{"gamesEditor":[{"id":"29694","title":"Turtle Hero Animal Rescue","description":"Join the fun and adventure in Turtle Hero Animal Rescue, a thrilling game with cute 2D cartoon animals. You have to collect yellow stars and reach the finish line in each level. The game tests your flexibility and precision as you navigate through various obstacles. The more stars you get, the more hearts you can buy to enhance your gameplay. Turtle Hero Animal Rescue is a game that will keep you entertained for hours.","instructions":"W jump S move down from the current platform ","url":"https:\/\/html5.gamemonetize.com\/0d020vrh23kp6y05gn2h3pvrkgbzlh7t\/","category":"Hypercasual","tags":"2D, Animal, Avoid, Boys, Collecting, Kids, Rescue, Superhero","thumb":"https:\/\/img.gamemonetize.com\/0d020vrh23kp6y05gn2h3pvrkgbzlh7t\/512x384.jpg","width":"1334","height":"750"},{"id":"29693","title":"Makeup Studio Halloween","description":"If youre still seeking inspiration for your Halloween look, then stop right here. Our social media influencers bring three jaw-dropping makeup looks that are going to help you steal the spotlights during the spookiest night of the year. In the Halloween Makeup Trends game for girls, you can learn from Kiki how to create a unicorn makeup look, from Riri how to obtain a colorful Dia de Los Muertes-inspired makeup look, and from Regina the secrets of sophisticated fantasy makeup. Play now!","instructions":"Use your mouse to play on desktops or tap to play on mobile devices ","url":"https:\/\/html5.gamemonetize.com\/wul4k3yav7wgmbrr5ly7wg989bs4fw0g\/","category":"Girls","tags":"1 Player, 2D, Fashion, Game, Games, Halloween, Holiday, HTML5, Makeover","thumb":"https:\/\/img.gamemonetize.com\/wul4k3yav7wgmbrr5ly7wg989bs4fw0g\/512x384.jpg","width":"1024","height":"768"},{"id":"29692","title":"Halloween Tiles Mahjong","description":"Experience Halloween Tile Matching with a 9-space stack. Tap tiles to stack and clear the board by finding 3 identical tiles while maintaining free space. Avoid overfilling the stack to achieve victory!","instructions":"Use a mouse or touchpad to play this game ","url":"https:\/\/html5.gamemonetize.com\/dqlhb2s10wpb6q5vitpcryu49ux12yvp\/","category":"Puzzles","tags":"Arcade, Halloween, Mahjong, Match-3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/dqlhb2s10wpb6q5vitpcryu49ux12yvp\/512x384.jpg","width":"800","height":"450"},{"id":"29691","title":"Bus Collect HTML5","description":"An easygoing brain-teaser where your goal is to land all passengers safely. Though it seems straightforward, it offers a surprising level of depth. Enjoy a wide range of levels while honing your problem-solving skills. Website Developer &lt;a href='https:\/\/www.game-plays.com'&gt;https:\/\/www.game-plays.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/mnl5ha2dyssilu9pa803w59ss4xknh7t\/","category":"Hypercasual","tags":"Android, Click, HTML5, iPad, iPhone, Mentolatux, Mobile, Spaceship, vehicle, WebGL","thumb":"https:\/\/img.gamemonetize.com\/mnl5ha2dyssilu9pa803w59ss4xknh7t\/512x384.jpg","width":"800","height":"600"},{"id":"29690","title":"SpobgeBob Halloween Coloring Book","description":"Dive into SpobgeBob Halloween Coloring Book! Express your creativity with SpobgeBob Halloween Coloring Book, a delightful and free online coloring game for all ages! Embark on a colorful adventure where you can bring your favorite SpobgeBob characters to life with just a tap of your finger. This game offers endless artistic possibilities and a chance to showcase your coloring skills in the spirit of Halloween.","instructions":"Mouse to play ","url":"https:\/\/html5.gamemonetize.com\/8vtkqr5xztqk5g2mtrkszlp741l1cwid\/","category":"Hypercasual","tags":"Arcade, Casual, Coloring, Halloween, Kids, Spongebob","thumb":"https:\/\/img.gamemonetize.com\/8vtkqr5xztqk5g2mtrkszlp741l1cwid\/512x384.jpg","width":"854","height":"480"},{"id":"29689","title":"Paper Pixel Adventure","description":"Paper Pixel Adventure is a very fun adventure game. You have to destroy the sweet monsters in the game and get the right to move on to other levels! No doubt you will have a lot of fun!","instructions":"W A S D or Arrow Keys Movement Space Attack When you enter the game from a mobile device you can use the touch controls on the screen ","url":"https:\/\/html5.gamemonetize.com\/4n0azlphf9zxu1heg0hdbgu7vst212va\/","category":"Adventure","tags":"1 Player, 2D, Adventure, Arcade, Block, Pixel, Platform","thumb":"https:\/\/img.gamemonetize.com\/4n0azlphf9zxu1heg0hdbgu7vst212va\/512x384.jpg","width":"800","height":"450"},{"id":"29687","title":"Skibidi Attack","description":"Welcome t Skibidi Attack shooting game! Tap or click to shoot skibidi toilets to get a high score! Dont let skibidi toilets come near to you. Enjoy and good luck!","instructions":"Tap or click to shoot","url":"https:\/\/html5.gamemonetize.com\/d3rkszqi4fjxzuv900ibqo6v1cdo3xed\/","category":"Shooting","tags":"Shooter, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/d3rkszqi4fjxzuv900ibqo6v1cdo3xed\/512x384.jpg","width":"720","height":"1280"},{"id":"29684","title":"Snow Rally","description":"SNOW RALLY is an exciting racing game where you drive your car on snowy and icy tracks. Based on realistic physics, this game challenges you to masterfully drive your car in the coldest and most inhospitable places on the planet. The game features different difficulty levels and modes, providing an interesting and varied gameplay experience. Each level offers unique obstacles and challenges, requiring skill, precision and quick response. With beautiful graphics, inspiring soundtrack and smooth controls, SNOW RALLY promises to provide you with hours of addictive gameplay. Choose your car, customize it to suit your driving style and go raci","instructions":"Drive through snowy mountains in this racing game based on the laws of physics Play for free Take on challenging driving tasks in the most dangerous inhospitable and coldest places in the world Show that you are the best racer on ice roads ","url":"https:\/\/html5.gamemonetize.com\/ipqdoc741flxpu6ho3su43k20h79k6mx\/","category":"Sports","tags":"1 Player, Car, Race, Snow, vehicle","thumb":"https:\/\/img.gamemonetize.com\/ipqdoc741flxpu6ho3su43k20h79k6mx\/512x384.jpg","width":"1280","height":"720"},{"id":"29683","title":"Pumpkin Dungeon Of Doom","description":"Pumpkin Dungeon Of Doom is an epic adventure through 100 levels of monsters, traps and danger!!! Have you got the brains and fast reflexes to escape all 100 dungeons in this unique action puzzle game? Bats will chase you, Ghosts will try and trick you, Monsters around every corner, Hazards include Spikes, Guillotines, Poison gas and more... Have you got what it takes? Product feature bullets: - Halloween Game! - 100 epic levels! - Cute graphic! - Cool creepy music! - Really addictive! - Easy to play! Enjoy with this great Halloween Puzzle Adventure game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/yzu5yllsp2ex40dlyydhiwwzosya0c85\/","category":"Puzzles","tags":"Adventure, Dungeon, Halloween, Horror, Mobile, Monster, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/yzu5yllsp2ex40dlyydhiwwzosya0c85\/512x384.jpg","width":"1024","height":"768"},{"id":"29682","title":"Skibidi Toilet MakeOver Playtime","description":"Welcome to your unique universe of toilet creatures, filled with the oddest, most amusing, and one-of-a-kind bathroom monsters! Youll have the opportunity to customize every aspect of your toilet monsters appearance. Aim for perfection, as your creation will be showcased on a leaderboard and scrutinized by a highly discerning audience. Prepare to unleash your creative flair and stay tuned for the grand finale: a trending monster dance. Website Developer &lt;a href='https:\/\/kiz10.com'&gt;https:\/\/kiz10.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ttoj989jdso0idjzp54ycu5kaookuk2c\/","category":"Hypercasual","tags":"2D, Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/ttoj989jdso0idjzp54ycu5kaookuk2c\/512x384.jpg","width":"800","height":"600"},{"id":"29681","title":"Pond Story","description":"Are you ready for a pond story? In this story you must save your friend and win the game! You can buy new equipment by collecting gold from the enemies you have destroyed and the environment!","instructions":"W A S D or Arrow Keys Movement R Change Weapon Space Attack When you enter the game from a mobile device you can use the touch controls on the screen ","url":"https:\/\/html5.gamemonetize.com\/2pqg3dvo5m20pzuxkqmk6o751361j2aq\/","category":"Adventure","tags":"1 Player, 2D, Adventure, Arcade, Monster, Pixel, Platform","thumb":"https:\/\/img.gamemonetize.com\/2pqg3dvo5m20pzuxkqmk6o751361j2aq\/512x384.jpg","width":"1280","height":"720"},{"id":"29680","title":"Monster Girls High School Squad","description":"Unleash your inner fashionista with the Monster Girls High School Squad dress-up game! Mix and match captivating outfits, accessorize with magical charms, and create spellbinding looks for supernatural students. Dive into a world of style, friendship, and enchantment as you explore the fantastic wardrobe options and dress up the alluring characters. Join the squad and let your creativity run wild in this thrilling fashion adventure!","instructions":"Left Mouse Button Click","url":"https:\/\/html5.gamemonetize.com\/2pyaysp1kfnotpbda3q9xdltzvuz0n4m\/","category":"Girls","tags":"Cute, Dress Up, Fashion, Girls, School","thumb":"https:\/\/img.gamemonetize.com\/2pyaysp1kfnotpbda3q9xdltzvuz0n4m\/512x384.jpg","width":"800","height":"600"},{"id":"29679","title":"Funny Cars Route","description":"Funny Cars Route is an exciting game where your task is to draw a path for cars so that they can park in places. The game has various levels, from easy to very difficult, which require you to be smart and draw, and you will need to park several different cars at the same time. When passing the levels, the paths will become more complicated, so you will have to put more effort and creativity to make all the cars pass.","instructions":"To start paving the way click on the car and lead the way to the parking lot of the same color and let go as soon as you pave the way and the direction of movement will correspond to the direction of parking ","url":"https:\/\/html5.gamemonetize.com\/dy9cz6llhbhwbmjjgcdlkztsdi9epyr9\/","category":"Puzzles","tags":"Car, Cars, Draw, Drawing, Funny, Level, Levels, Logic, Mobile","thumb":"https:\/\/img.gamemonetize.com\/dy9cz6llhbhwbmjjgcdlkztsdi9epyr9\/512x384.jpg","width":"1280","height":"720"},{"id":"29678","title":"Building Empire Tycoon","description":"Building Empire Tycoon is a flexible city simulator time management game that engages the player with its simple and addictive mechanics. This provides 3 modes to play including Time-Trial, Endless and Career, each bringing different missions and game play. Building Empire Tycoon is a game about buying and selling building for profit. Buy houses when their prices are at rock bottom, then sell them at their peak before the price crashes. Get rich in record time through virtual Building Empire speculations .","instructions":"Building Empire Tycoon is a game about buying and selling building for profit Buy houses when their prices are at rock bottom then sell them at their peak before the price crashes Get rich in record time through virtual Building Empire speculations Mo","url":"https:\/\/html5.gamemonetize.com\/413fyel12hcjjicekxbtkf0mqrfggsi2\/","category":"Hypercasual","tags":"Casual, Hypercasual, Management, Simulation","thumb":"https:\/\/img.gamemonetize.com\/413fyel12hcjjicekxbtkf0mqrfggsi2\/512x384.jpg","width":"960","height":"600"},{"id":"29677","title":"Portal Through IT","description":"Welcome to Portal Through It, a puzzle game that will put your problem-solving skills to the test. With 25 challenging levels, this game is sure to keep you entertained for hours.","instructions":"In this game youll control the players movements using only the mouse and use the space key for a faster run ","url":"https:\/\/html5.gamemonetize.com\/yiyb0lhy86uc4vp11stak3s4yc1crudy\/","category":"Puzzles","tags":"2D, Boys, Clicker, Mouse, Puzzle, Skill","thumb":"https:\/\/img.gamemonetize.com\/yiyb0lhy86uc4vp11stak3s4yc1crudy\/512x384.jpg","width":"640","height":"360"},{"id":"29676","title":"Night Neon Racers","description":"Night Neon Racers game is a 3D car racing game with various game modes. You can race against other cars or you can drift as much as you want and earn diamonds from all of these. The game also has a car blasting mode to explode vehicles in traffic and earn diamonds from those vehicles while having fun! Various super sports cars and very fun game modes are waiting for you! Lets play!","instructions":"Move W A S D or ARROW KEYS Nos LSHIFT Spawn R ","url":"https:\/\/html5.gamemonetize.com\/zrsbiulgpzj75g68zwldhd9s1edzttil\/","category":"Racing","tags":"3D, Action, Arcade, Cars, crash, drift, drifting, Driving, gta, Race, Racing, Simulator, Supercars, vehicle","thumb":"https:\/\/img.gamemonetize.com\/zrsbiulgpzj75g68zwldhd9s1edzttil\/512x384.jpg","width":"1280","height":"720"},{"id":"29675","title":"Cooking Madness Game","description":"Indulge in the addictive and fast-paced gameplay of Burger Cooking Game Online, a top-rated cooking game that offers a wide range of exciting features. From managing your own burger shop to exploring different food cultures, this game guarantees hours of simulation fun and strategy.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/9r1j2i8o8euql5330e4umgl0wupbialb\/","category":"Girls","tags":"Boys, Burger, Cooking, Food, Fun, Girls, Highscore, HTML5, Kids, Management, Mobile, Restaurant, Skill, Timing","thumb":"https:\/\/img.gamemonetize.com\/9r1j2i8o8euql5330e4umgl0wupbialb\/512x384.jpg","width":"720","height":"1280"},{"id":"29673","title":"Impossible Car Parking Master 2023","description":"Impossible Car Parking Master is a mobile parking game that challenges players to park their cars in tight and difficult spaces. The parking game features various levels with increasing difficulty, where players must maneuver their car into a designated parking spot while avoiding obstacles and other cars. The game features realistic graphics and physics, making it challenging to park in tight spaces. The goal of the game is to master the art of parking cars in challenging situations and achieve the highest score. Game Features: Realistic vehicle physics Different levels with increasing difficulty Different controls","instructions":"Use W A D and Arrow Keys to Move the Car Use Num 0 or N for Netural Use Num 1 or E for Acceleration Use Num 2 or R for Reverse ","url":"https:\/\/html5.gamemonetize.com\/ymkvkw8wag3u9m1212sqj135hg0ewycf\/","category":"Racing","tags":"1 Player, 3D, 3D Games, Best Games, Car, Parking, Stunts","thumb":"https:\/\/img.gamemonetize.com\/ymkvkw8wag3u9m1212sqj135hg0ewycf\/512x384.jpg","width":"800","height":"600"},{"id":"29672","title":"Soccer Hero","description":"A single player football game with multiple characters that can be developed and upgraded, using buttons to move and kick the ball.","instructions":"Press the button to control the characters movement and kicking method ","url":"https:\/\/html5.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/","category":"Soccer","tags":"1 Player, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/512x384.jpg","width":"1280","height":"720"},{"id":"29671","title":"Celebrity Halloween Costumes","description":"Welcome to Celebrity Halloween Costume Adventure! Your favorite celebrities are planning the perfect Halloween outfits together. Get ready for a star-studded Halloween experience as they choose and showcase their ultimate costumes. Unleash your inner celebrity with the hottest Halloween trends!","instructions":"Left Mouse Button Click","url":"https:\/\/html5.gamemonetize.com\/h91rjj9r8y7qhkwpcpf2ibixsebvnzh8\/","category":"Girls","tags":"Celebrity, Dress Up, Halloween","thumb":"https:\/\/img.gamemonetize.com\/h91rjj9r8y7qhkwpcpf2ibixsebvnzh8\/512x384.jpg","width":"800","height":"600"},{"id":"29670","title":"Candy Monster Box","description":"Candy Monster Box offers an engaging, captivating gameplay experience that ensures endless entertainment. Slide right or left to align the box with the candies. Share this complimentary game with your loved ones. Embark on an adventure in the candy universe. Assist the jelly monsters by unwrapping and gathering fruity candies for them.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/8y2socljhxgwy1wh0lk2d38gntaki4d8\/","category":"Hypercasual","tags":"2D, Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Monster, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/8y2socljhxgwy1wh0lk2d38gntaki4d8\/512x384.jpg","width":"800","height":"600"},{"id":"29669","title":"Delete Puzzle Parts","description":"Get ready for a popular brain game. Solve the puzzle by deleting some pieces in the puzzle. The Delete Puzzle Parts game may seem simple, but appearances can be deceiving. You must be careful and use the eraser correctly to reveal the mysterious pieces. You have to be cunning and careful. Delete Puzzle Parts game supports 9 languages and has 60+ different levels. Have Fun!","instructions":"Drag the mouse and start deleting ","url":"https:\/\/html5.gamemonetize.com\/ecymed0jcrdpfhidxgkhrxcgm9r42whg\/","category":"Puzzles","tags":"Best, Boys, Brain, Cartoon, Cleaning, Design, Draw, Drawing, Funny, Girls, Hypercasual, Kid, Kids, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ecymed0jcrdpfhidxgkhrxcgm9r42whg\/512x384.jpg","width":"800","height":"600"},{"id":"29668","title":"Impossible Tracks 2D","description":"Impossible Tracks 2D is an exciting 2D game where youll encounter a series of tricky levels. Each level is packed with challenging obstacles that will test your skills and reflexes. Navigate these treacherous tracks and conquer the obstacles to reach the finish line. Get ready for an adventure filled with fun and excitement in this thrilling game!","instructions":"Press Right Arrow Key D to move forward Press Left Arrow Key A to move backward","url":"https:\/\/html5.gamemonetize.com\/dm7la1p1srfqj8i6xtwcfo9e9tkkja8w\/","category":"Racing","tags":"2D, Adventure, Car, Obstacle, Racing","thumb":"https:\/\/img.gamemonetize.com\/dm7la1p1srfqj8i6xtwcfo9e9tkkja8w\/512x384.jpg","width":"1000","height":"450"},{"id":"29666","title":"Ban Ban Parkour","description":"Have you ever run to the door in the dark like this before? Run to the door with your friend in the dark one by one. Collect the toys you need to gather. Collect the toys to open the door. We need all the toys. You must race against time in the dark to survive. Reach the door before time runs out. Otherwise, you will die in the dark. Or you might get lost in the dark.","instructions":" Use WASD Keys to move and jump Collect the Bowling Toy first and then the remote control Toy in order Both mobile and desktop playability ","url":"https:\/\/html5.gamemonetize.com\/gswu7y7skc3a3x1hyy7njlunp85rfoov\/","category":"Arcade","tags":"2 Player, 2 Player Games, 2D, Adventure, Alien, Animal, Arcade","thumb":"https:\/\/img.gamemonetize.com\/gswu7y7skc3a3x1hyy7njlunp85rfoov\/512x384.jpg","width":"800","height":"600"},{"id":"29661","title":"Among vs Garten of Banban","description":"Among Us vs Garten Of Banban plays the role of an antagonist who will always scare every player. Take control of the among characters and solve the puzzles in more than 100 levels. Hide from the Garten monsters, collect objects to open doors and keys to complete all room challenges Website Developer &lt;a href='https:\/\/kiz10.com'&gt;https:\/\/kiz10.com&lt;\/a&gt;","instructions":"Use the mouse or touch to control the character","url":"https:\/\/html5.gamemonetize.com\/da8v5fs4u0i4bgg26z4skptd99dczd6q\/","category":"Puzzles","tags":"1 Player, 2D, Action, Adventure, Best Games, Casual, Crazy, HTML5, Hypercasual, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/da8v5fs4u0i4bgg26z4skptd99dczd6q\/512x384.jpg","width":"800","height":"480"},{"id":"29660","title":"Grimace Night","description":"Grimace Nigth is a fun adventure ride of in this Halloween season. Here in this fun adventure game, the little Grimace is moving around to collect the keys to unlock the portals for the exits. For that Grimace needs to collect the key on the way, but we all know the hurdles there in the abandoned area, but some are for your convenience, use the blocks to climb up and collect the keys and reach the end-fire to complete the level.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/k717yu8tji70vhhh4hbm00xya395kfut\/","category":"Puzzles","tags":"Adventure, Boy, Grimace, Grimace Shake, Halloween, HTML, Kids, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/k717yu8tji70vhhh4hbm00xya395kfut\/512x384.jpg","width":"1280","height":"800"},{"id":"29659","title":"BFFs Unique Halloween Costumes","description":"Join the BFFs Unique Halloween Costumes adventure! These best friends are on a mission to find the most creative and distinctive Halloween outfits. Get ready for a one-of-a-kind Halloween experience as they plan, choose, and showcase their unique costumes. Unleash your creativity and celebrate Halloween like never before with the trendiest and most original looks! Website Developer &lt;a href='https:\/\/cutedressup.com'&gt;https:\/\/cutedressup.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/nkd7qrglyqh1w1nqap19mhn3zu1r61rq\/","category":"Girls","tags":"Cute, Dress Up, Halloween","thumb":"https:\/\/img.gamemonetize.com\/nkd7qrglyqh1w1nqap19mhn3zu1r61rq\/512x384.jpg","width":"800","height":"600"},{"id":"29658","title":"ROBOTS ENIGMA","description":"Coins are scattered throughout the level, collect as many coins as you can while navigating through the challenging terrain.Defeat all enemy units to achieve victory.","instructions":"Use WASD or arrow keys to move the player and click left mouse button to attack ","url":"https:\/\/html5.gamemonetize.com\/ya5f3mwrtttq0lfgw9yuf8v3v88h5zo0\/","category":"Shooting","tags":"Action, Adventure, Battle, Fight, Robot, survival","thumb":"https:\/\/img.gamemonetize.com\/ya5f3mwrtttq0lfgw9yuf8v3v88h5zo0\/512x384.jpg","width":"960","height":"600"},{"id":"29657","title":" Halloween Moster Vs Zombies","description":"Welcome to the exciting and scary world of Halloween Monster Vs Zombies! In this addictive and fun game, you take on the role of a brave monster in search of the most delicious Halloween candies. However, theres a problem: the cemetery is full of hungry zombies, and theyll do anything to stop you from getting your favorite candies!","instructions":"Mouse click or tap on the mobile screen Use mouse click or tap on the screen to control your monsters movement Tap to jump over obstacles and avoid zombies while collecting the tasty candies","url":"https:\/\/html5.gamemonetize.com\/vuu0litxi4kyn4rr0wew8berqwbdy5co\/","category":"Arcade","tags":"Adventure, Arcade, Halloween","thumb":"https:\/\/img.gamemonetize.com\/vuu0litxi4kyn4rr0wew8berqwbdy5co\/512x384.jpg","width":"1920","height":"1080"},{"id":"29652","title":"Pumpkin Smash","description":"Pumpkin Smash is a delightful and addictive game that captures the essence of the fall season, offering players a fun and visually appealing experience filled with pumpkin-related adventures. Whether youre a fan of casual games or simply looking for some autumn-themed entertainment, Pumpkin Madness is the perfect way to celebrate the season.","instructions":"WASD or Arrow keys - gt Move the Player Space - gt Jump Mouse Move - gt Direction of the weapon Left mouse click - gt Attack","url":"https:\/\/html5.gamemonetize.com\/885k33tjwfqv1ak1sk13xme863r2r9rk\/","category":"Hypercasual","tags":"Adventure, Arcade, Casual, Halloween, hunter, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/885k33tjwfqv1ak1sk13xme863r2r9rk\/512x384.jpg","width":"960","height":"600"},{"id":"29651","title":"Halloween Mazes","description":"Halloween Mazes is a thrilling puzzle game with twists and turns. Race against the clock to find a path from the entrance to the exit before time runs out. Can you solve 12 puzzles and emerge victorious? Give it your best shot!","instructions":"Navigate the skullball using the keyboards arrow keys or effortlessly guide it to exit with a mouse or touchpad ","url":"https:\/\/html5.gamemonetize.com\/cx7lirc5bpqg1e3s2zup2sebkts92ka0\/","category":"Puzzles","tags":"Board, Halloween, HTML5, Maze, Mobile","thumb":"https:\/\/img.gamemonetize.com\/cx7lirc5bpqg1e3s2zup2sebkts92ka0\/512x384.jpg","width":"800","height":"450"},{"id":"29650","title":"Flappy Halloween2","description":"Flappy Halloween is a fun and addictive game that captures the spirit of Halloween while challenging players to test their reflexes and coordination. Its a perfect choice for enjoying some Halloween-themed entertainment on your computer during the spooky season.","instructions":"Click to make your pumpkin fly The game is endless and the objective is to see how far you can go without colliding with any obstacles ","url":"https:\/\/html5.gamemonetize.com\/6w366mgxfl4oz9p0pg4bpntks97bn8ze\/","category":"Hypercasual","tags":"Casual, Halloween, Hypercasual, Skill, Skills","thumb":"https:\/\/img.gamemonetize.com\/6w366mgxfl4oz9p0pg4bpntks97bn8ze\/512x384.jpg","width":"960","height":"600"},{"id":"29649","title":"Halloween Makeup Trends","description":"If youre still seeking inspiration for your Halloween look, then stop right here. Our social media influencers bring three jaw-dropping makeup looks that are going to help you steal the spotlights during the spookiest night of the year. In the Halloween Makeup Trends game for girls, you can learn from Kiki how to create a unicorn makeup look, from Riri how to obtain a colorful Dia de Los Muertes-inspired makeup look, and from Regina the secrets of sophisticated fantasy makeup. Play now! Website Developer &lt;a href='https:\/\/prinxy.app\/'&gt;https:\/\/prinxy.app\/&lt;\/a&gt;","instructions":"Use your mouse to play the game on a desktop and tap to play for mobile devices ","url":"https:\/\/html5.gamemonetize.com\/y5t7ngdllxo9155eihuv1iwz9nhtj40u\/","category":"Girls","tags":"Fashion, Halloween, Holiday, HTML5, Makeover","thumb":"https:\/\/img.gamemonetize.com\/y5t7ngdllxo9155eihuv1iwz9nhtj40u\/512x384.jpg","width":"1024","height":"768"},{"id":"29648","title":"Color Bubbles Ultra","description":"Pop all the colorful bubbles by shooting at them, and get to the boss faster than they get close to you. The faster and more accurately you cope with the task, the more points you will earn!","instructions":"By clicking the mouse or finger you need to shoot at single-colored bubbles to burst them Dont let the bubbles get too low The main goal is to get to the boss and hit him with any ball ","url":"https:\/\/html5.gamemonetize.com\/c5qoon8j2wrsu1sah11nm2dxle6zjlmu\/","category":"Puzzles","tags":"Bubble, Bubble Shooter, Color, Fun, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/c5qoon8j2wrsu1sah11nm2dxle6zjlmu\/512x384.jpg","width":"720","height":"1280"},{"id":"29647","title":"Car Parking Lot 2023","description":"Car Parking Lot is an exciting and challenging mobile game that puts your parking skills to the test. Get ready to navigate a variety of vehicles through a maze of obstacles and tight spaces to reach the designated parking spots. With stunning 3D graphics and realistic physics, this game offers an immersive parking experience. Choose from a range of vehicles, from compact cars to large trucks, each with its unique handling characteristics. Can you master the art of precision parking and conquer every level? Website Developer &lt;a href='https:\/\/www.bestcrazygames.com'&gt;https:\/\/www.bestcrazygames.com&lt;\/a&gt;","instructions":"WASD to drive ESC to menu c to cahnge camera","url":"https:\/\/html5.gamemonetize.com\/7t4u52tdicqex560gqzzkls0l5j55nhd\/","category":"Action","tags":"3D Games, Car, Mentolatux, Parking, Super, Supercars, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/7t4u52tdicqex560gqzzkls0l5j55nhd\/512x384.jpg","width":"800","height":"600"},{"id":"29646","title":"Zoo Tycoon","description":"Zoo Tycoon is a captivating simulation game that lets you become the ultimate zookeeper. Build and manage your dream zoo, carefully selecting animals, creating immersive habitats, and keeping your visitors happy. Whether you want to nurture endangered species, design thrilling exhibits, or maximize profits, the choice is yours. With stunning graphics and realistic gameplay, Zoo Tycoon offers endless hours of fun and challenges. Will you create a world-renowned animal haven or a bustling wildlife attraction? Website Developer &lt;a href='https:\/\/www.brightygames.com'&gt;https:\/\/www.brightygames.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/kb4nylf2luxv6nnde2x449ypxtjlodmu\/","category":"Adventure","tags":"1 Player, Adventure, Animal, Arcade, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/kb4nylf2luxv6nnde2x449ypxtjlodmu\/512x384.jpg","width":"800","height":"600"},{"id":"29641","title":"Ninja Ghost","description":"Ninja Ghost immerses you in the world of a ninja on a mission to confront notorious bandit leaders. Prepare to be captivated by the smooth ninja controls, including Slow Motion moves, and the dynamic gameplay. Your primary objective is to take down these formidable bosses, and whether you choose to eliminate their entire team or opt for a more peaceful approach is entirely up to you. In this game, youll step into the shoes of an unparalleled, elusive, incredibly agile, and mighty master of melee combat. Website Developer &lt;a href='https:\/\/www.game-plays.com'&gt;https:\/\/www.game-plays.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/mumwz453w0wt583is22yzet2fhwla4je\/","category":"Arcade","tags":"Android, HTML5, iPad, iPhone, Level, Mentolatux, Mobile, Ninja, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/mumwz453w0wt583is22yzet2fhwla4je\/512x384.jpg","width":"800","height":"600"},{"id":"29640","title":"Classic chess","description":"Classic chess is a two-player board game played on a chessboard with 64 squares arranged in rows of an 8x8 grid. Each player starts with 16 pieces: including a king, one queen, two knights, two rooks, two bishops and eight pawns. The goal of this chess game is to checkmate the opponents king, putting him in imminent danger of being captured. The game can be played with artificial intelligence or together with another person on the same device. The game also has the ability to solve chess problems.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/4ntoq6issim7yfpyk52gtf7v8dowre4s\/","category":"Puzzles","tags":"Board","thumb":"https:\/\/img.gamemonetize.com\/4ntoq6issim7yfpyk52gtf7v8dowre4s\/512x384.jpg","width":"800","height":"600"},{"id":"29639","title":"Kids Summer Ice Desserts","description":"Indulge in the ultimate frozen delight with Kids Summer Ice Desserts! Immerse yourself in a world of deliciousness and have endless hours of fun with this addictive collection of ice cream-themed games. Enjoy a variety of gameplay modes, vibrant graphics, and fantastic challenges that will keep you entertained.","instructions":"Use the mouse or finger to play ","url":"https:\/\/html5.gamemonetize.com\/ims9luyymdruymgjvgqh9d89cfubc4qo\/","category":"Girls","tags":"Cooking, Food, Fruit, Fun, Girls, HTML5, Ice, Kids, Mobile, Summer","thumb":"https:\/\/img.gamemonetize.com\/ims9luyymdruymgjvgqh9d89cfubc4qo\/512x384.jpg","width":"504","height":"800"},{"id":"29638","title":"Duck X Target","description":"The pond is a great habitat for friendly ducks, but it was captured by evil brethren and marine life. Armed with a gun, shoot at moving targets, but be careful! The faster and more accurately you shoot, the more the time scale will be maintained, which will allow you to score more points. Help your feathered friends protect the pond and bring calm back to it in the shooting gallery Ducks-Target!","instructions":"Use the mouse cursor to move the sight Left mouse button - shot Also a tap on the device with a touch screen is responsible for moving the sight and the shot ","url":"https:\/\/html5.gamemonetize.com\/gk1cs8aguuwgkv289io14c6oir3qpvel\/","category":"Puzzles","tags":"Mobile, Puzzle, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/gk1cs8aguuwgkv289io14c6oir3qpvel\/512x384.jpg","width":"1280","height":"720"},{"id":"29634","title":"Card Memory Match","description":"Card Memory Match","instructions":"Click or Touch","url":"https:\/\/html5.gamemonetize.com\/2mgeccmvxbmgw5nkk2mvrvsry7ennecj\/","category":"Puzzles","tags":"Card, Memory, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/2mgeccmvxbmgw5nkk2mvrvsry7ennecj\/512x384.jpg","width":"800","height":"600"},{"id":"29633","title":"Barbie Match Master","description":"Play as your favorite Barbie characters in this exciting match-3 puzzle game, Barbie Match Master! Remove tiles from play by making sets of three or more of the same kind. Youll get access to more playable characters and levels as you make your way through the game. Moreover, you may compete with your friends to see who can achieve the highest score.","instructions":"Desktop Use the right click button of the mouse to match 3 or more barbies Mobile Click and connect to match 3 or more barbies Controls and Indicators The scores and levels are shown in the upper middle of the screen ","url":"https:\/\/html5.gamemonetize.com\/1xrjdtyrktyk0kn1441nu93wpw01liyc\/","category":"Puzzles","tags":"2D, Baby Hazel, Barbie, HTML, HTML5, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/1xrjdtyrktyk0kn1441nu93wpw01liyc\/512x384.jpg","width":"720","height":"1280"},{"id":"29631","title":"Battle Warship Arena","description":"Battle Warship Arena is a thrilling 2D naval combat game that lets you command your own warship and blast away enemy ships. You can choose from five different ships and five unique captains, each with their own skills and abilities. You can also upgrade your warship&amp;rsquo;s firepower, armor, speed, and more. To win each level, you need to destroy all enemy ships while staying within the red circle. If you go outside the circle, your warship will take constant damage until it sinks. Battle Warship Arena is a fun and challenging game that will test your strategic skills and reflexes. Are you ready to rule the seas?","instructions":"Tap buttons to aim and shoot hold wheel to move","url":"https:\/\/html5.gamemonetize.com\/lvpy2a5xbyd2xj8h5oeqzspfevjiuy15\/","category":"Boys","tags":"Battle, Boat, Casual, Kids, Simulation","thumb":"https:\/\/img.gamemonetize.com\/lvpy2a5xbyd2xj8h5oeqzspfevjiuy15\/512x384.jpg","width":"1334","height":"750"},{"id":"29630","title":"Mountain Tank","description":"A tank shooting game with multiple tanks, enhanced upgrades, and various terrain levels.Button controlled tank movement and shooting.","instructions":"Button controlled tank movement and shooting ","url":"https:\/\/html5.gamemonetize.com\/qrh3ov788e2pho4lisrwxjofjcmauvg1\/","category":"Shooting","tags":"1 Player, Adventure, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/qrh3ov788e2pho4lisrwxjofjcmauvg1\/512x384.jpg","width":"1334","height":"750"},{"id":"29629","title":"Duo Nether","description":"Things are getting even tougher in the second part of the series, so are you up for this adventure? The adventure is getting increasingly difficult. There are monsters and traps everywhere. Tell your friend right away and join this adventure. Remember, youre in for an even more challenging adventure. Steve and Alex are now stronger with their swords. You must be high off the ground to throw the sword. Jump-Throw the sword and kill all the enemies. Collect all the white bone dust stones. Open the chests and both of you reach the door.","instructions":" Played with WASD Arrow Keys Mobile touch control is available To throw the sword use the Q and P keys ","url":"https:\/\/html5.gamemonetize.com\/ge1c2bm02dldn7ted5bibt7q720kucn3\/","category":"Arcade","tags":"1 Player, 2 Player, 2 Player Games, 2D, Action, Adventure, Alien, Arcade, Battle, Minecraft, Pixel","thumb":"https:\/\/img.gamemonetize.com\/ge1c2bm02dldn7ted5bibt7q720kucn3\/512x384.jpg","width":"800","height":"600"},{"id":"29628","title":"Uno Multiplayer","description":"Uno Multiplayer is an exhilarating digital adaptation of the classic card game that brings friends and family together for hours of fun. Challenge your strategic thinking and card-playing skills as you compete against players from around the world. Whether youre looking for a quick match or an epic showdown, Uno Multiplayer offers various modes and customizable rules to suit your style. With vibrant visuals and seamless online play, its the perfect way to connect, strategize, and enjoy the timeless Uno experience with players across the globe. Website Developer &lt;a href='https:\/\/www.coolcrazygames.com\/'&gt;https:\/\/www.coolcrazygames.com\/&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ibja5jflqdvaolwh7frjlvjxcut2b6ev\/","category":"Arcade","tags":"Arcade, Card, Classic, Multiplayer, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/ibja5jflqdvaolwh7frjlvjxcut2b6ev\/512x384.jpg","width":"900","height":"600"},{"id":"29627","title":"Hamburger Cooking Game","description":"Welcome to the delightful and addictive Hamburger Cooking Game! Unleash your inner chef and embark on a culinary adventure like no other. Cook, decorate, and serve scrumptious hamburgers to satisfy the cravings of your customers. Engage in a fun-filled cooking experience while improving your culinary skills. Lets dive into the details of this exciting hamburger game!","instructions":"Are you new to the world of hamburger-cooking games No worries Hamburger Cooking Game provides a user-friendly interface and easy-to-follow instructions Learn how to select ingredients customize toppings grill the perfect patty and assemble a burger","url":"https:\/\/html5.gamemonetize.com\/1hy918k1utcb0lcd14skyyzc1896gh6b\/","category":"Girls","tags":"Burger, Cleaning, Cooking, Cute, Dress Up, Fashion, Food, Fun, HTML5, Kids, Mobile, Restaurant, RPG","thumb":"https:\/\/img.gamemonetize.com\/1hy918k1utcb0lcd14skyyzc1896gh6b\/512x384.jpg","width":"800","height":"504"},{"id":"29626","title":"Super Ball Collect HTML5","description":"An easygoing brain-teaser where your mission is to land all the passengers safely. It appears straightforward but offers surprising depth. Enjoy a wide range of levels while honing your mental agility and having a great time. Website Developer &lt;a href='https:\/\/www.crazygamesonline.com'&gt;https:\/\/www.crazygamesonline.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/nn8ess1wgmxuksnfqh0yd6l6jhc5s573\/","category":"Hypercasual","tags":"Android, Arcade, Clicker, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile","thumb":"https:\/\/img.gamemonetize.com\/nn8ess1wgmxuksnfqh0yd6l6jhc5s573\/512x384.jpg","width":"800","height":"600"},{"id":"29625","title":"Twerk Rush","description":"You must run and gain weight in this entertaining game to fight for the twerk champion title! Only the fearless and confident players go for it! Pay attention and march on the treadmill! Lets show everyone how performing this kind of popular dance can be enjoyable!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/n2i6wkl05emm6mg3i589nnxoaa9uivwx\/","category":"Arcade","tags":"3D, Arcade, Casual, HTML5, Online","thumb":"https:\/\/img.gamemonetize.com\/n2i6wkl05emm6mg3i589nnxoaa9uivwx\/512x384.jpg","width":"800","height":"600"},{"id":"29624","title":"Need for Race","description":"Are you ready to accept the speed challenge and show everyone that you are a real racer without fear? Its time to come to the start of the race and drive as much as possible by car, avoiding collisions and not flying off the track! Rearrange between lanes, perform extreme detours and do everything possible to continue moving forward. The longer you can continue the race without collisions, the higher your speed will be and the higher the maximum record.","instructions":"The car moves automatically Clicking on the right side of the screen allows you to turn it to the right clicking on the left side of the screen makes a left turn You can also turn using the A D keys or the right and left arrows on the keyboard ","url":"https:\/\/html5.gamemonetize.com\/mb8kyh2eioqmmh42g3tw8tkk98yl6h7y\/","category":"Racing","tags":"Car, Cars, Driving, Mobile, Race, Racing, Road, Supercars, vehicle","thumb":"https:\/\/img.gamemonetize.com\/mb8kyh2eioqmmh42g3tw8tkk98yl6h7y\/512x384.jpg","width":"720","height":"1280"},{"id":"29618","title":"Pumpkin Roll","description":"The winter season is coming and Mr. Pumpkin needs help to find all missing Gifts! So help Mr. Pumpkin to find all the missing Christmas Gifts! enjoy this fantastic game in a Christmas\/Halloween atmosphere. Spin Mr. Pumpkini, avoid obstacles and dangers and travel through three different worlds to recover all the missing Gifts. Enjoy Halloween season with this great puzzle cool game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/kpkwznlr3v2q330ejqo3obmilblij9ou\/","category":"Puzzles","tags":"Arcade, Christmas, Family, Halloween, Puzzle, Winter","thumb":"https:\/\/img.gamemonetize.com\/kpkwznlr3v2q330ejqo3obmilblij9ou\/512x384.jpg","width":"600","height":"1024"}]}