{"gamesHot":[{"id":"29683","title":"Pumpkin Dungeon Of Doom","description":"Pumpkin Dungeon Of Doom is an epic adventure through 100 levels of monsters, traps and danger!!! Have you got the brains and fast reflexes to escape all 100 dungeons in this unique action puzzle game? Bats will chase you, Ghosts will try and trick you, Monsters around every corner, Hazards include Spikes, Guillotines, Poison gas and more... Have you got what it takes? Product feature bullets: - Halloween Game! - 100 epic levels! - Cute graphic! - Cool creepy music! - Really addictive! - Easy to play! Enjoy with this great Halloween Puzzle Adventure game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/yzu5yllsp2ex40dlyydhiwwzosya0c85\/","category":"Puzzles","tags":"Adventure, Dungeon, Halloween, Horror, Mobile, Monster, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/yzu5yllsp2ex40dlyydhiwwzosya0c85\/512x384.jpg","width":"1024","height":"768"},{"id":"29682","title":"Skibidi Toilet MakeOver Playtime","description":"Welcome to your unique universe of toilet creatures, filled with the oddest, most amusing, and one-of-a-kind bathroom monsters! Youll have the opportunity to customize every aspect of your toilet monsters appearance. Aim for perfection, as your creation will be showcased on a leaderboard and scrutinized by a highly discerning audience. Prepare to unleash your creative flair and stay tuned for the grand finale: a trending monster dance. Website Developer &lt;a href='https:\/\/kiz10.com'&gt;https:\/\/kiz10.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ttoj989jdso0idjzp54ycu5kaookuk2c\/","category":"Hypercasual","tags":"2D, Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/ttoj989jdso0idjzp54ycu5kaookuk2c\/512x384.jpg","width":"800","height":"600"},{"id":"29672","title":"Soccer Hero","description":"A single player football game with multiple characters that can be developed and upgraded, using buttons to move and kick the ball.","instructions":"Press the button to control the characters movement and kicking method ","url":"https:\/\/html5.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/","category":"Soccer","tags":"1 Player, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/512x384.jpg","width":"1280","height":"720"},{"id":"29661","title":"Among vs Garten of Banban","description":"Among Us vs Garten Of Banban plays the role of an antagonist who will always scare every player. Take control of the among characters and solve the puzzles in more than 100 levels. Hide from the Garten monsters, collect objects to open doors and keys to complete all room challenges Website Developer &lt;a href='https:\/\/kiz10.com'&gt;https:\/\/kiz10.com&lt;\/a&gt;","instructions":"Use the mouse or touch to control the character","url":"https:\/\/html5.gamemonetize.com\/da8v5fs4u0i4bgg26z4skptd99dczd6q\/","category":"Puzzles","tags":"1 Player, 2D, Action, Adventure, Best Games, Casual, Crazy, HTML5, Hypercasual, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/da8v5fs4u0i4bgg26z4skptd99dczd6q\/512x384.jpg","width":"800","height":"480"},{"id":"29659","title":"BFFs Unique Halloween Costumes","description":"Join the BFFs Unique Halloween Costumes adventure! These best friends are on a mission to find the most creative and distinctive Halloween outfits. Get ready for a one-of-a-kind Halloween experience as they plan, choose, and showcase their unique costumes. Unleash your creativity and celebrate Halloween like never before with the trendiest and most original looks! Website Developer &lt;a href='https:\/\/cutedressup.com'&gt;https:\/\/cutedressup.com&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/nkd7qrglyqh1w1nqap19mhn3zu1r61rq\/","category":"Girls","tags":"Cute, Dress Up, Halloween","thumb":"https:\/\/img.gamemonetize.com\/nkd7qrglyqh1w1nqap19mhn3zu1r61rq\/512x384.jpg","width":"800","height":"600"},{"id":"29603","title":"Barbiemania","description":"Experience the ultimate makeup adventure with Barbiemania! Join the iconic doll, Ellie, and create stunning looks for three occasions. Lets dive into the magical world of Barbiemania and unleash your inner stylist!","instructions":"Use your mouse to play on a desktop and tap to play for mobile devices ","url":"https:\/\/html5.gamemonetize.com\/wdeki0lf306m9z07slrsasu6idpi20gm\/","category":"Girls","tags":"1 Player, Barbie, Fashion, Girl, HTML5, Makeover, Mobile","thumb":"https:\/\/img.gamemonetize.com\/wdeki0lf306m9z07slrsasu6idpi20gm\/512x384.jpg","width":"1024","height":"768"},{"id":"29592","title":"Racing Horizon","description":"Racing Horizon is a 3D and unlimited racing game in which you race consistently in highway traffic with your super-powerful car. The game contains various sport car models and various upgrade options. You can start a very long highway racing career or you can drive on an endless map. You can also join a police chase mission. Various highway racing maps and various cars and game modes are waiting for you! Lets go!","instructions":"Move W A S D or ARROW KEYS NOS N Change camera C","url":"https:\/\/html5.gamemonetize.com\/qgb6n2r17f8b3a5gvf0lf1mncx6fzd2e\/","category":"Racing","tags":"1 Player, 3D, 3D Games, Adventure, Car, Driving, Race, Simulation, Traffic, WebGL","thumb":"https:\/\/img.gamemonetize.com\/qgb6n2r17f8b3a5gvf0lf1mncx6fzd2e\/512x384.jpg","width":"800","height":"450"},{"id":"29582","title":"Fighter Legends Duo","description":"Epic fighting adventure is beginning with the Fighter Legends Duo game! The fighting adventure will be in various places like temples, military areas, deserts, caves, and many other places. The fighters are picked from legendary fighters of all time and this will be All Star fighting tournament. Pick the fighter take your place in the fighting arena and start fighting against these super-talented fighters.","instructions":"Player 1 Move W A S D Punch F Kick G Special H Player 2 Move ARROW KEYS Punck K Kick L Special J","url":"https:\/\/html5.gamemonetize.com\/8nv3jd35egnqso4tamip9k8u04mdfgun\/","category":"Action","tags":"1 Player, 2 Player, 2 Player Games, Action, Arcade, Arena, Fight, Fighting, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/8nv3jd35egnqso4tamip9k8u04mdfgun\/512x384.jpg","width":"800","height":"450"},{"id":"29580","title":"Posing Puzzle","description":"Posing Puzzle is a funny game where you must help your characters to change their poses &amp;amp; posture, help them blend into various shapes to escape a relentless pursuer in a limited time. Test your reflexes and problem-solving skills as you guide your characters to safety while evading capture. With each level, the challenges become more challenging, offering an exciting blend of puzzles and quick-thinking","instructions":"Tap into your characters to switch to the suitable pose that fits into the shape You may have to think twice if there is more than 2 person that need to hide","url":"https:\/\/html5.gamemonetize.com\/1d0q0upiud8b176a1vsagz9objq3yran\/","category":"Puzzles","tags":"2D, Anime, Collection, Fun, Girl, Puzzle, Relaxation, WebGL","thumb":"https:\/\/img.gamemonetize.com\/1d0q0upiud8b176a1vsagz9objq3yran\/512x384.jpg","width":"1080","height":"1920"},{"id":"29579","title":"Super Stunt car 7","description":"Fun and enjoyment filled stunt car game with casual fun and also challenging levels. Beat the other players in the multiplayer racing arena and rise to the top! Tweak your car to be the best on the planet! This game has muscle cars, jump ramps, Loops, fire rings, racing tracks, skill tracks, puzzle tracks, racing against trains, customisable cars, monster trucks, online racing and upgradable cars from stunt to monster car levels. Download now! Win the challenges in stunt tracks with your excellent stunt car! Drive on tracks with jumps, loops and obstacles! Race against a train! Beat the cop cars in San Francisco! Try the new racing levels a","instructions":"Use W and S to move Forward and Backward Use A and D to move Left and Right ","url":"https:\/\/html5.gamemonetize.com\/cxrki3r51lxtdoso58xui05si74uehfk\/","category":"Racing","tags":"1 Player, 3D, Action, Adventure, Car, Cars, Racing, Stunts, Supercars","thumb":"https:\/\/img.gamemonetize.com\/cxrki3r51lxtdoso58xui05si74uehfk\/512x384.jpg","width":"800","height":"600"},{"id":"29572","title":"Fry Skibidi","description":"Enjoy this Halloween season with this amazing puzzle horror game featuring the character of the moment Skibidi Toilet! Fry Skibidi is the coolest physics-based puzzle game. Drop the Skibidi down onto a metal block by destroying all the other blocks. Once all the blocks are gone and the Skibidi is on a metal block press the ZAPPER button to fry Skibidi! explore all three worlds and clear all the puzzles.","instructions":"Mouse click or tap to play The main goal is to land the Skibidi on the metal block and once all blocks are destroyed press the zapper button to fry the Skibidi ","url":"https:\/\/html5.gamemonetize.com\/0hjb1exftvmf1hkt6oz69r2irilyaq63\/","category":"Puzzles","tags":"Arcade, Block, Boy, HTML5, Mobile, Physics, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/0hjb1exftvmf1hkt6oz69r2irilyaq63\/512x384.jpg","width":"1280","height":"720"},{"id":"29560","title":"Couples Outfit Change Challenge","description":"Step into the world of style and creativity as you embark on a makeover adventure like no other. Take on the challenge of swapping wardrobe and discover how well you can style each other in this exciting game. From head to toe, mix and match outfits to create unique and unforgettable looks.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/v6ecd8704ko7hucc7kydb69poe9klffg\/","category":"Girls","tags":"Disney, Dress Up, Fashion, Frozen, Girls, Makeover, Princess","thumb":"https:\/\/img.gamemonetize.com\/v6ecd8704ko7hucc7kydb69poe9klffg\/512x384.jpg","width":"800","height":"600"},{"id":"29558","title":"Skibidi Toilet FPS Shooting Survival","description":"Skibidi Toilet FPS Shooting Survival is an exhilarating video game that combines fast-paced first-person shooting action with a unique twist. Players find themselves in a perilous situation as they battle enemies in a world where toilets become battlegrounds. With a quirky and humorous concept, this game offers a refreshing take on the traditional FPS genre. Strategize, shoot, and survive in this wacky virtual arena filled with unexpected challenges and laughter-inducing moments. Get ready to plunge into the Skibidi Toilet FPS Shooting Survival adventure! Website Developer &lt;a href='https:\/\/www.kizi10.org\/'&gt;https:\/\/www.kizi10.org\/&lt;\/a&gt;","instructions":"WASD walk mouse left shoot and mouse right AIM","url":"https:\/\/html5.gamemonetize.com\/eoeo4gswxn1whp6mkold64qn6dunff5w\/","category":"Shooting","tags":"Mentolatux, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/eoeo4gswxn1whp6mkold64qn6dunff5w\/512x384.jpg","width":"800","height":"600"},{"id":"29554","title":"Road Madness","description":"If you like race cars and guns, you will love this game! You can upgrade and unlock more destructive cars, the further you get. Enjoy epic effects and power ups while hunting the new bosses and get achievements for it!","instructions":"Shoot enemy cars and upgrade your gear to survive in higher levels Avoid obstacles and gather power ups from destroyed special enemies Defeat bosses at the end of levels to progress further ","url":"https:\/\/html5.gamemonetize.com\/pcfjrvn3isqukyuyf6i3gffax8kvibgr\/","category":"Hypercasual","tags":"Driving, HTML, HTML5","thumb":"https:\/\/img.gamemonetize.com\/pcfjrvn3isqukyuyf6i3gffax8kvibgr\/512x384.jpg","width":"600","height":"800"},{"id":"29552","title":"Skibidi Blast","description":"Hey Skibidi needs your help to escape from this dark prison! The main goal is to land Skibidi in the safe area with the least number of attempts! You just use the explosive to move Skibidi in the right direction but be aware at the dangerous spikes! Are you able to get the three stars for each level?","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/q520nwk8b5t7x9yk05lwzytm6hd8aak7\/","category":"Puzzles","tags":"Arcade, Bomb, Boy, HTML5, Mobile, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/q520nwk8b5t7x9yk05lwzytm6hd8aak7\/512x384.jpg","width":"1024","height":"768"},{"id":"29550","title":"Battleground Survival 2023","description":"Battleground Survival is an adrenaline-pumping, action-packed multiplayer survival game that drops players onto a deserted island, where the ultimate goal is to be the last person or team standing. As a skilled survivalist, youll need to rely on your wits, strategy, and combat prowess to outlast your rivals in this intense virtual battleground. Website Developer &lt;a href='https:\/\/www.bestcrazygames.com\/'&gt;https:\/\/www.bestcrazygames.com\/&lt;\/a&gt;","instructions":"WASD walk SHIFT run MOUSE shooting aim and scroll change gun TAB menu","url":"https:\/\/html5.gamemonetize.com\/bbjdiu2s8se9muqkdbllq6by8qy4ds3t\/","category":"Shooting","tags":"Mentolatux, Shooting, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/bbjdiu2s8se9muqkdbllq6by8qy4ds3t\/512x384.jpg","width":"800","height":"600"},{"id":"29542","title":"Skibidi Toilet Roll ","description":"The winter season is coming and Skibidi Toilet needs help to find all missing sweets! So help Skibidi to find all the missing Christmas sweets! enjoy this fantastic game in a Christmas atmosphere. Spin Skididi, avoid obstacles and dangers and travel through three different worlds to recover all the missing sweets. Enjoy this great puzzle cool game!","instructions":"Click on left to move left Click on right to move right Key Left to move left Key Right to move right ","url":"https:\/\/html5.gamemonetize.com\/c8hx9eklsrwc6y5jge531vdmkxxm1lnt\/","category":"Puzzles","tags":"Arcade, Boys, HTML5, Mobile, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/c8hx9eklsrwc6y5jge531vdmkxxm1lnt\/512x384.jpg","width":"600","height":"1024"},{"id":"29532","title":"Toca Life Adventure","description":"Run out any story with Toca Life adventure. You&amp;rsquo;ll get all the fun of your other favorite levels such as City, Vacation, Office, Hospital, and more, all together in one place. Collect balls to increase the score and unlock new characters.Website Developer &lt;a href='https:\/\/kiz10.com'&gt;https:\/\/kiz10.com&lt;\/a&gt;","instructions":"Use the mouse or touch","url":"https:\/\/html5.gamemonetize.com\/wl12iuserxdpc4y0b8vcjoz6alzccms5\/","category":"Hypercasual","tags":"1 Player, 2 Player, 2D, Adventure, Arcade, Best Games, Cartoon, endless, Family, Fantasy, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/wl12iuserxdpc4y0b8vcjoz6alzccms5\/512x384.jpg","width":"800","height":"480"},{"id":"29531","title":"Skibidi 2","description":"In this game you control Skibidi Toilet; so moving them around a world that revolves around you. As you move around the landscape your character clings o the ground via gravity &amp;ndash; use it your advantage to move from one platform to the next. This is a fun exploring adventure games enjoy it!","instructions":"Keyboard Left Key Rotate Left Right Key Rotate Right Spacebar Key Jump","url":"https:\/\/html5.gamemonetize.com\/3oy1wzmfelk3d066vtt0ddxsd7imsvg3\/","category":"Puzzles","tags":"Adventure, Boy, HTML, Mobile, Physics, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/3oy1wzmfelk3d066vtt0ddxsd7imsvg3\/512x384.jpg","width":"1024","height":"768"},{"id":"29530","title":"My Perfect Hotel HTML5","description":"Have you ever imagined the thrill of owning your very own hotel? Embark on an exciting journey from the very foundation in this enjoyable and high-speed time-management game. Your ultimate goal: construct an extensive lodging empire that showcases your unwavering commitment to the art of hospitality. As a hotel manager, showcase your talents, make prudent investments in both your staff and property enhancements, and exert every ounce of effort to ascend to the pinnacle of the hospitality industry. Website Developer &lt;a href='https:\/\/www.crazygamesonline.com\/'&gt;https:\/\/www.crazygamesonline.com\/&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/d8lg0h02680rgd2eevhgir54oshr5cgz\/","category":"Arcade","tags":"1 Player, Android, Casual, HTML5, Hypercasual, iPad, iPhone, Management, Mentolatux, Mobile, Simulation, Simulator","thumb":"https:\/\/img.gamemonetize.com\/d8lg0h02680rgd2eevhgir54oshr5cgz\/512x384.jpg","width":"800","height":"600"},{"id":"29522","title":"Grand Cyber City","description":"A very long and entertaining story is beginning with the Grand Cyber City game. The game mainly contains various vehicle simulations like car simulation, bike, motorbike, rocket, and parachute simulations. The game contains various game modes either as missions, races, challenges, and free modes. Drive or ride whatever you want in the city, participate in events, collect coins, fly with your rocket, or speed up to the end of the limits with your car. By various vehicles, you will have fun to the end! Various cars and super customization options are waiting for you in the garage. Let the super adventure begin!","instructions":"PLAYER 1 Move W A S D or ARROW KEYS NOS SHIFT or N Weapon Q or E Look behind T Reset Car R Change camera C IF YOU PLAYING 2 PLAYER PLAYER 1 Move W A S D NOS SHIFT or N Open gun F Look behind T Reset Car R Change camera C PLAYER 2 Move AR","url":"https:\/\/html5.gamemonetize.com\/ibvlqrkmvay6y6tlftsz99vvh09oz6eu\/","category":"Racing","tags":"Action, Battle, Bike, Cars, drifting, Driving, Flight, gta, Motorcycle, Race, Rocket, Simulation, Simulator, WebGL","thumb":"https:\/\/img.gamemonetize.com\/ibvlqrkmvay6y6tlftsz99vvh09oz6eu\/512x384.jpg","width":"800","height":"450"},{"id":"29511","title":"Skibidi Toliet Puzzle Game","description":"Are You able to collect all the purple Goo? Squash the Goos as you roll, climb, bounce, and zoom around devilishly designed levels. A challenge awaits anyone hard enough to squash some Goos! This physics-based puzzle game is hours of enjoyment for the whole family!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/eavbg7zz3syd5fcsblpikk41hygsptnv\/","category":"Puzzles","tags":"HTML, Mobile, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/eavbg7zz3syd5fcsblpikk41hygsptnv\/512x384.jpg","width":"10280","height":"800"},{"id":"29507","title":"Mahjong Solitaire: World Tour","description":"Mahjong Solitaire: World Tour elevates tile-matching. Solve levels to explore global cities in a journey through time. With striking graphics and smooth gameplay, its a must for puzzle lovers. Start your ultimate Mahjong adventure today!","instructions":"Remove matching tiles by tapping them but remember that only unblocked tiles can be picked ldquo Unblocked rdquo tiles are tiles that have an open edge and nothing on top of it ","url":"https:\/\/html5.gamemonetize.com\/scp0z5cwaa8x6sh0sznt5gd1boplv8zj\/","category":"Puzzles","tags":"1 Player, Adventure, Casual, Logic, Logical, Mahjong, Match 3, Matching, Solitaire","thumb":"https:\/\/img.gamemonetize.com\/scp0z5cwaa8x6sh0sznt5gd1boplv8zj\/512x384.jpg","width":"1280","height":"720"},{"id":"29503","title":"Grimace Bullet Blender","description":"In the exciting game Grimace Bullet Blender, players are tasked with a thrilling challenge. Their objective is to click on the police officer or any object on the map to direct the bullet towards the character, Grimace. Once the bullet is perfectly aligned with Grimace, a SHOOT button will appear, ready to be activated. This dynamic gameplay mechanic adds an element of precision and strategy to the game, making it an engaging experience for players of all ages. Website Developer &lt;a href='https:\/\/www.crazygamesonline.com\/'&gt;https:\/\/www.crazygamesonline.com\/&lt;\/a&gt;","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/74ijtek8l89t61rhi0x5f7f4feuhh78r\/","category":"Shooting","tags":"Android, Grimace, Grimace Shake, Mentolatux, Mobile, Shoot, Shooting, Top Down, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/74ijtek8l89t61rhi0x5f7f4feuhh78r\/512x384.jpg","width":"800","height":"600"},{"id":"29500","title":"Daddy Escape","description":"Daddy Escape-Save Pull Pin Out game is a unique hyper casual puzzle game. Use your brain to solve the tricky pin pull out puzzle game and get the daddy out before it&amp;rsquo;s too late. In this pull pin game, Help Daddy rescue to escape from the dangerous home be careful about Monsters, Villains, Bombs, Spike, Lava and all such dangerous obstacles. Its now up to your puzzle game critical thinking of how you will get the daddy out escape games and save him. If you like escape and pull the pin games, You will love this how-to loot - Save daddy brain puzzle. Let test your IQ with Daddy Escape game.","instructions":"- Pull the pins in the right order and save the daddy - Just a small mistake can lose daddy - Train your brain with this daddy rescue game ","url":"https:\/\/html5.gamemonetize.com\/a7n5ti86okzul9z3h9o8wqkg1blo04wh\/","category":"Puzzles","tags":"1 Player, 2D, Best Games, HTML5, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/a7n5ti86okzul9z3h9o8wqkg1blo04wh\/512x384.jpg","width":"400","height":"700"},{"id":"29489","title":"Math Trivia","description":"Math Trivia is a Fun Math Trivia Game containing Brainy Math Puzzles &amp;amp; Quizzes which helps you to learn basic problems, equations, sequences, series, etc.Math Trivia will help you develop abstract and logical thinking, develop perseverance, sharpen the intellect, ability to analyze, raise IQ, and memory. This Math Trivia Consists of multiple levels from simple to complex. With each level, it gets more complicated and more interesting.","instructions":"- Tap the RIGHT answer button from the 4 multiple choices - Select the correct answer before the time expires - There are 3 quizzes for each level and get rewards after completing 4 levels - Try a HINT to help you remove a wrong spelling option - Use","url":"https:\/\/html5.gamemonetize.com\/tbtdqtmxvd1bjwl9bsbpf7nzlm7zu3h3\/","category":"Puzzles","tags":"Math, Quiz","thumb":"https:\/\/img.gamemonetize.com\/tbtdqtmxvd1bjwl9bsbpf7nzlm7zu3h3\/512x384.jpg","width":"800","height":"600"},{"id":"29474","title":"Assassin Ninja Rush","description":"Experience high-octane ninja action in Assassin Ninja Rush! Take control of an assassin ninja, sprinting and dodging through enemies. Strategically eliminate foes to reach new levels. Unlock characters and weapons by completing levels or using gold coins in the in-game store. Dodge bullets, smash crates for health, and hone your skills to become the ultimate ninja assassin! Assassin Ninja Rush delivers an immersive, arcade-style 3D adventure that will put your ninja abilities to the test.","instructions":"Tap and drag to aim rush route release to let the ninja move","url":"https:\/\/html5.gamemonetize.com\/4u0xi4xzgenklu3n77ikfb0ra7rztbzo\/","category":"Adventure","tags":"2D, Avoid, Collecting, Platform, run, Stickman","thumb":"https:\/\/img.gamemonetize.com\/4u0xi4xzgenklu3n77ikfb0ra7rztbzo\/512x384.jpg","width":"1334","height":"750"},{"id":"29458","title":"Motor Stunt Simulator 3D","description":"The most thrilling motorcycle stunt game is here! In Motor Stunt Simulator 3D, you can enjoy the most exciting tracks! Each level brings you a new experience! Each level has a unique design! Can you pass them all? The most important thing is that each level has three stars! They are in different places! Can you find them all? Try this game! Have fun!","instructions":"W Accelerate S backward A Steer left D Steer right","url":"https:\/\/html5.gamemonetize.com\/sx60zz45e6khlxbs4if4f11cgbmll81s\/","category":"Sports","tags":"3D, Avoid, Bike, Collecting, Platform, Simulation, Stunts","thumb":"https:\/\/img.gamemonetize.com\/sx60zz45e6khlxbs4if4f11cgbmll81s\/512x384.jpg","width":"1334","height":"750"},{"id":"29444","title":"Hammer Strike","description":"Hammer Strike - A highly captivating game with a pleasant and relaxing atmosphere. Children can play this game to develop their intellect. A mesmerizing puzzle for all players. Simply click on the object and rotate it. After completing the puzzle, the battle button is activated. Click on the battle button and start the fight, destroying the enemy. An easy game for children and a challenging one for adults. Hammer Strike is a simple yet captivating and exhilarating game that will bring enjoyment to players for many hours.","instructions":"In the game Hammer Strike you create the correct angle combination by clicking on our shielded friends then click the hammer button to destroy enemies and advance to the next level ","url":"https:\/\/html5.gamemonetize.com\/9xtvzppoev5dez3xawvfyory9y4qijsd\/","category":"Puzzles","tags":"1 Player, 3D, Best, Casual, Click, Fun, Funny, Games, Puzzle, Simulation","thumb":"https:\/\/img.gamemonetize.com\/9xtvzppoev5dez3xawvfyory9y4qijsd\/512x384.jpg","width":"1600","height":"900"},{"id":"29442","title":"UnstoppableShooter","description":"Unstoppable Shooter is a shooting game. By adjusting the shooting strength and direction of the stickman equipment, you can resist the constantly attacking enemies.","instructions":"Click on the blank space to continue The angle of the ups and dynamic adjustment adjustment","url":"https:\/\/html5.gamemonetize.com\/42k8bct5nde66kw9jtdlxi8hpsw9sl4u\/","category":"Hypercasual","tags":"1 Player, 2D, Shooting","thumb":"https:\/\/img.gamemonetize.com\/42k8bct5nde66kw9jtdlxi8hpsw9sl4u\/512x384.jpg","width":"1136","height":"640"},{"id":"29441","title":"Fat OR Thin","description":"The Fat or Thin game is a fun, relaxing runner where you can help a cute furry bear lose extra weight after winter hibernation! There are more than 30 fascinating levels ahead of you, each of which you must pass the obstacle course and finish, not forgetting to watch your diet. Are you ready to take your will in your fist and completely give up burgers, pizza, and doughnuts, replacing them with healthier food?","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ucv0bh73v900fke5o7viaxihiv27piz9\/","category":"Arcade","tags":"3D, Arcade, Casual, HTML5, Online","thumb":"https:\/\/img.gamemonetize.com\/ucv0bh73v900fke5o7viaxihiv27piz9\/512x384.jpg","width":"800","height":"600"},{"id":"29429","title":"Toilet Monster Long Neck","description":"Introducing Skibidi, a groundbreaking game featuring entirely unique gameplay mechanics. In this immersive experience, you take on the role of an endlessly extendable Skibidi Toilet. Utilize your intelligence and agility to outwit and defeat the CameraMan. The game offers an array of challenging yet engaging levels designed to captivate your attention. Website Developer &lt;a href='https:\/\/www.crazygamesonline.com\/'&gt;https:\/\/www.crazygamesonline.com\/&lt;\/a&gt;","instructions":"Mouse click or tap to play Extend the neck of the Skibidi Toilet to accomplish various objectives Immerse yourself in this highly creative gameplay experience as you manipulate the elongated neck of the Skibidi Toilet to form amusing shapes ","url":"https:\/\/html5.gamemonetize.com\/utz8cejau7u57kg8jj5eqieyx6q98td2\/","category":"Action","tags":"2D, Android, HTML5, iPad, iPhone, Mentolatux, Mobile, Skibidi, Skibidi Toilet, Skill","thumb":"https:\/\/img.gamemonetize.com\/utz8cejau7u57kg8jj5eqieyx6q98td2\/512x384.jpg","width":"800","height":"600"},{"id":"29424","title":"Roblox: Parachute","description":"This game offers an addictive obstacle course experience that takes you on an adrenaline-fuelled adventure. You will test your agility, calculation and precision to overcome this challenging obstacle course. Fast jumps, dynamic platforms and deadly traps will require you to utilise your skills to the max. As you navigate the dangerous terrain, you will struggle to be the fastest and most careful player. Your goal in this fun parkour game is to complete each challenge as fast as possible!","instructions":"- WASD - control the character - Space bar - jump - Esc - pause the game - Rotate the camera with the mouse - R - use the parachute with the key - Shift - key to speed up even more ","url":"https:\/\/html5.gamemonetize.com\/pdmu6wmpaxb64q67qgswtegbi4u116za\/","category":"Arcade","tags":"1 Player, 3D, 3D Games, Best, Best Games, Boys, Casual, Color, Girls, jump, Kid, Obstacle, unity, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/pdmu6wmpaxb64q67qgswtegbi4u116za\/512x384.jpg","width":"800","height":"450"},{"id":"29423","title":"Red Moon","description":"Once a decade, the moon shines Red... on that day, we, the Red Samurais, gain its immense power. Can you feel it? With its power, we will seize this kingdom. Are you ready to unleash the fury? Join Eivana on a grand adventure to overthrow the king. Play through 20 action packed levels, engage in 2 wild boss battles, while unlocking 13 medals as well as various concept art and music.","instructions":"Use the arrow keys to move and Z Y to attack You can make double-jumps if you jump again while in the air The Red meter shows your health and the Blue meter shows your power You need power to perform special attacks which you do with the Spacebar ","url":"https:\/\/html5.gamemonetize.com\/l5w737qbz4h8lkrw5boo6r6dzp66n4q6\/","category":"Adventure","tags":"1 Player, 2D, Adventure, Game, Games, HTML, HTML5, Online, Red, Samurai","thumb":"https:\/\/img.gamemonetize.com\/l5w737qbz4h8lkrw5boo6r6dzp66n4q6\/512x384.jpg","width":"960","height":"550"},{"id":"29407","title":"Dead Aim: Skibidi Toilets Attack","description":"Dead Aim: Skibidi Toilets Attack is a shooting game where you play as special forces soldier on a city streets invaded by skibidi toilets and your mission is to shoot them all in order to survive and unlock 10 types of weapons.","instructions":"WASD - Move LMB - Shoot R - Reload Space - Jump ","url":"https:\/\/html5.gamemonetize.com\/glr4degbtojrnmiudrcmmkw2o7b7gnqp\/","category":"Shooting","tags":"1 Player, 3D, 3D Games, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/glr4degbtojrnmiudrcmmkw2o7b7gnqp\/512x384.jpg","width":"960","height":"600"},{"id":"29406","title":"Skibidi Smasher","description":"Skibidi Toilet Smasher is an exciting alien-killing game where you have to defend your area without getting infected! Kill as many Skibidi Toilet and they will become faster on further waves, so boost your reflexes and kill the fast-paced game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/2qexn83qkjlbjo55cg9brqgadhlbk9uv\/","category":"Clicker","tags":"Alien, Clicker, HTML, Mobile, Shooting, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/2qexn83qkjlbjo55cg9brqgadhlbk9uv\/512x384.jpg","width":"1024","height":"768"},{"id":"29404","title":"Kingdom of Toilets","description":"You need to help the toilet robots escape from this underground prison filled with obstacles. You must assist them in escaping. Be careful as there are toxic waters everywhere underground. You must collect all the gold coins, or else the portal wont activate. Collect all the gold coins to activate the portal.","instructions":" Played with WASD Arrow Keys Mobile touch control is available double jump available ","url":"https:\/\/html5.gamemonetize.com\/mce44c3kkyd0sqn7a6kn1ts3043bhust\/","category":"2 Player","tags":"2 Player, 2 Player Games, 2D, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/mce44c3kkyd0sqn7a6kn1ts3043bhust\/512x384.jpg","width":"800","height":"600"},{"id":"29394","title":"Skibidi Dungeon Of Doom","description":"Skibidi Dungeon Of Doom is an epic adventure through 100 levels of monsters, traps and danger. Have you got the brains and fast reflexes to escape all 100 dungeons in this unique action puzzle game. Bats will chase you, Ghosts will try and trick you, Monsters around every corner, Hazards include Spikes, Guillotines, Poison gas and more... Have you got what it takes? Product feature bullets: - Skibidi On Board! - 100 epic levels! - cute graphic! - cool music! - addictive! - easy to play! Enjoy with this great Puzzle Adventure game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/glrgua15poz2jfhvr1sctrpxmy1937sl\/","category":"Puzzles","tags":"Boy, HTML, HTML5, Mobile, Puzzle, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/glrgua15poz2jfhvr1sctrpxmy1937sl\/512x384.jpg","width":"1024","height":"768"},{"id":"29393","title":"Skibidi Toilet Hunter","description":"In Skibidi Toilet Hunter, assume the role of a determined Skibidi armed with WASD controls and mouse left-click attacks. Your mission: hunt down AI cameramen lurking in toilets. This comically unique world is filled with twists and turns. Click anywhere on the screen to look around, uncovering hidden enemies. Embark on this quirky adventure and become the ultimate Skibidi Toilet Hunter in a hilarious quest where toilets are battlegrounds, and cameramen are your targets. Website Developer &lt;a href='https:\/\/www.bestcrazygames.com\/'&gt;https:\/\/www.bestcrazygames.com\/&lt;\/a&gt;","instructions":"WASD walk ARROw walk MOUSE LEFT attack CLICK MOUSE look around","url":"https:\/\/html5.gamemonetize.com\/yjuaf7eewx4fe5tsn44pdnni5q60f34b\/","category":"Action","tags":"3D Games, Mentolatux, Science, Skibidi, Skibidi Toilet, Space, Top Down, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/yjuaf7eewx4fe5tsn44pdnni5q60f34b\/512x384.jpg","width":"800","height":"600"},{"id":"29384","title":"Grimace vs giant clown shoes","description":"Help grimace escape from the giant clown shoe. Collect the coins with Grimaces image on them to break the platforms and the hamburgers to push the giant shoe away. Watch out for the small shoes! If you get hit, youll slow down.","instructions":"Touch or click on the left or right side of the screen Cursors left and right on the keyboard","url":"https:\/\/html5.gamemonetize.com\/a444wv2y6ce7cxrj5bp7jv6q8bi9esxr\/","category":"Arcade","tags":"Arcade, Classic, Grimace, Kids, Platform","thumb":"https:\/\/img.gamemonetize.com\/a444wv2y6ce7cxrj5bp7jv6q8bi9esxr\/512x384.jpg","width":"720","height":"1280"},{"id":"29382","title":"Skibidi Drop","description":"Skibidi Drop is a 60 levels of fun physics puzzle game! all boxes except the grass must be removed where the prison is standing. Simply click or tap on the boxes or blocks to destroy them. Carefully use the set blocks in what ever way you can to get the Skibidi Toilet safely into the grass. You can reset each level if you made a wrong move. Solve this fun physics game and enjoy!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ulo1xmnruftzt0dd6tsog3vsvf9jektg\/","category":"Puzzles","tags":"Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/ulo1xmnruftzt0dd6tsog3vsvf9jektg\/512x384.jpg","width":"1280","height":"800"},{"id":"29381","title":"Bicycle Stunts Racing 2023","description":"Bicycle Stunts Racing is an exhilarating sport that combines precision and daring. Riders push the limits of balance and skill, performing jaw-dropping tricks and flips on two wheels. From backflips to wheelies, its a heart-pounding spectacle. Safety gear is crucial as these athletes race against time, defying gravity to leave spectators in awe. Whether on dirt tracks or city streets, Bicycle Stunts Racing is an adrenaline-fueled pursuit that showcases the incredible athleticism of its participants. Website Developer &lt;a href='https:\/\/www.crazygamesonline.com\/'&gt;https:\/\/www.crazygamesonline.com\/&lt;\/a&gt;","instructions":"WASD drive","url":"https:\/\/html5.gamemonetize.com\/7yodi87kk5va0dtrcasviepnk1kxe9eo\/","category":"Racing","tags":"Action, Bicycle, Bike, Driving, Levels, Racing, Stunts, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/7yodi87kk5va0dtrcasviepnk1kxe9eo\/512x384.jpg","width":"800","height":"600"},{"id":"29374","title":"Solitaire: Spider and Klondike","description":"Immerse yourself in the captivating world of solitaire and test your strategic planning and logical thinking abilities. This version offers two popular variations: Spider and Klondike. Spider has three modes (1, 2, and 4 suits). In Spider solitaire, your goal is to arrange cards in ascending order by suit. Untangle the complex web of cards using the fewest moves possible. Klondike offers the standard game with a single deck of cards. Your task is to clear the playing field by building sequences from King to Ace, alternating colors.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/81w3k4zsktl5r97mu2zoc581jsfb0oe4\/","category":"Puzzles","tags":"1 Player, Board, Card, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/81w3k4zsktl5r97mu2zoc581jsfb0oe4\/512x384.jpg","width":"800","height":"600"},{"id":"29373","title":"Skibidi Online","description":"Skibidi Online is a multiplayer shooter game! Shoot attacking Skibidi Toilets in PvP or CO-OP mode. Fight on 10 different maps with melee and ranged weapons.","instructions":"Mouse click to attack WASD to move Space to jump E to equip weapon TAB to view stats","url":"https:\/\/html5.gamemonetize.com\/zsp6q6syr025l3eaypqw6rxm9myjqn39\/","category":"Multiplayer","tags":".io, .io Games, 3D, 3D Games, Action, Multiplayer, Shooter, Skibidi, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/zsp6q6syr025l3eaypqw6rxm9myjqn39\/512x384.jpg","width":"800","height":"600"},{"id":"29358","title":"Real Airplane Simulator","description":"Here is an airplane-driving simulation game. There are many different airplanes to unlock and select in the garage. Following the green arrow and lines, adjust the height instantly. More practice will help you complete all levels.","instructions":"Switch views for better driving sense Follow the hints","url":"https:\/\/html5.gamemonetize.com\/l2mrm0gwkvuj1g0qy0acw6fj7xnzxmas\/","category":"Action","tags":"3D, airplane, Driving, Mobile, Parking, Simulation, Timing","thumb":"https:\/\/img.gamemonetize.com\/l2mrm0gwkvuj1g0qy0acw6fj7xnzxmas\/512x384.jpg","width":"1079","height":"615"},{"id":"29344","title":"Climb Racing 3D","description":"A variety of characters, cars and maps are waiting for you in the car racing game full of fun and adventure, based on 3D physics and with colorful visual effects. Choose your vehicle and hit the road for endless driving experience. Get an advantage by collecting bonuses. We wish you to have a pleasant time in the fun and action-packed car racing game. Have fun!","instructions":"Movement A-D RIGHT and LEFT ARROW KEYS Nitro J Magnet K All Wheel Drive L Hint You can steer the car into the air with the forward and reverse consumers","url":"https:\/\/html5.gamemonetize.com\/gjfls53ild9pfyssb4btixekteqoh7py\/","category":"Racing","tags":"3D Games, Action, Adventure, Boys, Cars, offroad","thumb":"https:\/\/img.gamemonetize.com\/gjfls53ild9pfyssb4btixekteqoh7py\/512x384.jpg","width":"800","height":"450"},{"id":"29342","title":"Kid Ball Adventure","description":"Enter a fantasy world of bouncing balls and magic castles in Kid Ball Adventure is a 2D platformer where risk is balanced with great reward! Take control of Kid Ball as he pursues those who captured his love through treacherous castle dungeons. To guide Kid Ball to victory, you will need to overcome many challenging stages filled with traps and deadly enemies, bouncing over spikes and using booster cannons to your advantage! Locate the key and unlock the exit to move on to the next daunting chamber of hazards!","instructions":"Arrow keys on the Desktop Buttons on Mobile","url":"https:\/\/html5.gamemonetize.com\/30q2nhz4ns0p9q7nn6bk1lrmsbml8i0c\/","category":"Hypercasual","tags":"1 Player, 2D, Adventure, Best, Casual, Funny, Kid, Kids, Platform","thumb":"https:\/\/img.gamemonetize.com\/30q2nhz4ns0p9q7nn6bk1lrmsbml8i0c\/512x384.jpg","width":"800","height":"480"},{"id":"29333","title":"Slime Knight","description":"Slime Knight is an arcade-platform game where you have to explore an ancient castle with a tiny but brave knight! Defeat the enemies on the floor with the knights sword to help him to advance to the next one.","instructions":"Desktop -X Space Up Arrow or Right Click to Jump -S C or Left Click to Throw Swords Mobile -Ingame Controls ","url":"https:\/\/html5.gamemonetize.com\/wyrv3daj2x60fpyxyyj6rvyv5e40aurx\/","category":"Arcade","tags":"Action, Arcade, Pixel, Platform, Retro","thumb":"https:\/\/img.gamemonetize.com\/wyrv3daj2x60fpyxyyj6rvyv5e40aurx\/512x384.jpg","width":"800","height":"600"},{"id":"29331","title":"Beat Shooter Game","description":"Extreme entertainment with tracks in Beat Shooter. Not a spontaneous game, but you will be the one to create good tunes for yourself. Players will choose their favorite gun from the tons of guns available in the game. Use your gun to shoot the falling squares; make sure you don&amp;rsquo;t miss a block. Get a bonus for every gas you hit, get rich with your sniping skills.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/w7pleqnur76mjg95cnp1joojczahaovq\/","category":"Puzzles","tags":"Best Games, Boys, Girls, Gun, Kid, Music","thumb":"https:\/\/img.gamemonetize.com\/w7pleqnur76mjg95cnp1joojczahaovq\/512x384.jpg","width":"750","height":"1334"},{"id":"29329","title":"Summer Aesthetics","description":"Hop on a plane and spend your summer vacation traveling around the world together with your favorite Disney princesses. Discover beautiful sceneries and practice your fashion advisor skills while helping them choose their outfits of the day in the Summer Aesthetics Dress Up Game for girls! Have a blast!","instructions":"Use your mouse on your desktop and tap to play on your mobile device ","url":"https:\/\/html5.gamemonetize.com\/o1r25m69jjjvgxgb8p4xp9i6zkgmod50\/","category":"Girls","tags":"1 Player, Dress Up, Fashion, HTML5, Mobile, Princess","thumb":"https:\/\/img.gamemonetize.com\/o1r25m69jjjvgxgb8p4xp9i6zkgmod50\/512x384.jpg","width":"1024","height":"768"},{"id":"29324","title":"Zrist DX","description":"Dodge endless obstacles while you get used to constantly shifting rules! Extended and upgraded version of Zrist, an endless runner where the play rules are modified on the go. This new version has a progression system, a shop, and much more!","instructions":"Desktop -X or Left Click to Jump -C or Right Click to Slide Mobile -Touch Right to Jump -Touch Left to Slide ","url":"https:\/\/html5.gamemonetize.com\/mmbnapzidjavkvd8kolb9s4a7rzyfr2w\/","category":"Arcade","tags":"1 Player, 2D, Action, Arcade, endless, Pixel, Retro","thumb":"https:\/\/img.gamemonetize.com\/mmbnapzidjavkvd8kolb9s4a7rzyfr2w\/512x384.jpg","width":"704","height":"528"}]}