{"games":[{"id":"49603","title":"Halloween Head Soccer","description":"Are you ready to go head to head on a football match? Choose mode 1P or 2P to get started. Choose your favorite Halloween character! Hit the ball into the goal to score points before the time runs out. The player with the most goals wins the game","instructions":"GAME CONTROLS Single-player Mode- Arrow keys to move Z X for shoot Player 1 - A D keys to move N M for shoot Player 2 - Arrow keys to move 1 2 for shoot","url":"https:\\/\\/html5.gamemonetize.com\\/j06hqptx0yf7x3o2ylart0hktgih6ocm\\/","category":"Sports","tags":"Action, Multiplayer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/j06hqptx0yf7x3o2ylart0hktgih6ocm\\/512x384.jpg","width":"1280","height":"720"},{"id":"49366","title":"T20 Cricket","description":"Come and join the T20 cricket game! It takes place in a busy stadium with excited fans. The game is played on a green field. Pick the Bangladesh cricket team and show off your amazing skills and strategies. In this game, the bowler runs quickly towards the wicket and throws the ball fast. You have to play the role of the batsman and have to react quickly and either defend the ball or hit it hard. Showcase your cricket skills in front of others in your group.","instructions":"Mobile Tap on the screen to hit the ball PC Click on the screen to hit the ball ","url":"https:\\/\\/html5.gamemonetize.com\\/3tgpavmaczut7bt1k4wgjkj09wco7s06\\/","category":"Sports","tags":"Arcade, Ball, Hypercasual, NapTech Games, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/3tgpavmaczut7bt1k4wgjkj09wco7s06\\/512x384.jpg","width":"1280","height":"720"},{"id":"49156","title":"Basketball Kings 2024","description":"Enter one of the four basketball courts and outshine everyone wherever you go. Zero-in on the hoop and shoot! Reach a high score to unlock new balls. Which ball will you play best with?","instructions":"A simple basketball game where your goal is to shoot the basket as many times as you can within the time limit You have to be quick and precise Try to reach the highest score and new balls will unlock The longer you play the less place for mistakes yo","url":"https:\\/\\/html5.gamemonetize.com\\/xnzfab1hm5q86ofc9z9zuibgibo2wcrl\\/","category":"Sports","tags":"Arcade, Ball, Basketball, Shoot, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/xnzfab1hm5q86ofc9z9zuibgibo2wcrl\\/512x384.jpg","width":"600","height":"800"},{"id":"49237","title":"Sumo Smash!","description":"Step into the ring and embrace the ancient art of Sumo&mdash; with a twist! Welcome to Sumo Smash! an exhilarating game where youll wrestle for supremacy while indulging in a sushi feast to grow your sumo size. Features: Grow to Dominate. Push to Win. Treasure Chests &amp; Skins: Unlock treasure chests found within the arena to collect unique skins","instructions":"WASD or QZSD to move on desktop Touch to move on mobile ","url":"https:\\/\\/html5.gamemonetize.com\\/zyjcvyrbjdb4400t324nzijc1in3hi5k\\/","category":"Sports","tags":".io, .io Games, 3D, 3D Games, Action, Arcade, Arena, Avoid, Bounce, Fighting, Funny, sumo","thumb":"https:\\/\\/img.gamemonetize.com\\/zyjcvyrbjdb4400t324nzijc1in3hi5k\\/512x384.jpg","width":"800","height":"600"},{"id":"48498","title":"Skibidi Basket","description":"Skibidi Toilet Basketball is a simple but very Addictive game which base on realistic physics! Tap and slide the Skibidi Toilet ball, control its angle and power, then shoot towards the hoop. The perfect effect and physic effect will help you see more clearly. The game is an endless arcade game, then shoot towards the hoop to win the levels; as the difficulty could increases, there are four different random movements for the hoop. You have just 3 shoots to complete each level! Are you able to try to sign the best record in the leaderboard? HOW TO PLAY: 1. Touch the screen! 2. Drag the ball to change the power and angle! 3. Release to shoot!","instructions":"Mouse click or tap to play","url":"https:\\/\\/html5.gamemonetize.com\\/xttsh0p5t89s0nx8fc2ariyade3whekt\\/","category":"Sports","tags":"Basketball, Skibidi, Skibidi Toilet, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/xttsh0p5t89s0nx8fc2ariyade3whekt\\/512x384.jpg","width":"1024","height":"600"},{"id":"48980","title":"Skibidi Toilet Pong","description":"Get ready to dive into the hilariously entertaining world of Skibidi Toilet Pong, the ultimate 2-player pong game that guarantees endless laughter and heaps of fun. And heres the best part &ndash; you can enjoy this side-splitting game online, completely free of charge! Challenge your friends or family to a game thats sure to keep you entertained for hours. Skibidi Toilet Pong is not your ordinary pong game; it adds a quirky twist to the classic, making it an unforgettable gaming experience. So, grab a partner, aim, and shoot your way to victory in this uproarious adventure that wont cost you a penny to play.","instructions":"Use W S and Up and Down arrow to play ","url":"https:\\/\\/html5.gamemonetize.com\\/0o124x0fb0vd51286iigv4hz5oam9b2c\\/","category":"Sports","tags":"2 Player, Arcade, HTML5, Kids, Skibidi, Skibidi Toilet, Skill, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/0o124x0fb0vd51286iigv4hz5oam9b2c\\/512x384.jpg","width":"854","height":"480"},{"id":"48690","title":"Grimace Penalty","description":"The Grimace Penalty Goal Game is a fun and challenging game where you have to attempt to score a penalty goal against a Grimace. To score a goal, you need to time your shot carefully and aim for the right spot in the goal. The Grimace will move around, so you need to be quick and accurate if you want to succeed. If you miss three goal, the game will be over.","instructions":"PC You can use the mouse to click on the football and aim at the net Mobile Tap on the football and aim at the net then swipe to goal ","url":"https:\\/\\/html5.gamemonetize.com\\/5u56pdgeqaju8sgzonpu8ktd4tkxm5ce\\/","category":"Sports","tags":"Action, Best Games, Football, Fun, Grimace, Grimace Shake, NapTech Games, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/5u56pdgeqaju8sgzonpu8ktd4tkxm5ce\\/512x384.jpg","width":"720","height":"1280"},{"id":"48616","title":"Grimace Vs Skibidi","description":"Like in a great tennis game, Help Grimace to stopping the tennis balls fired by Skibidi! Toilet! but requires speed and precision, make one mistake and you&rsquo;re out! its may be simple to play but it&rsquo;s a challenge to get high scores! The longer You stay on ground, the faster the tennis balls will come at you and it is your job to return them while also avoiding flying bottles. Youre warned! the Platinum medal is VERY hard to complete! only if youre a true grand slam may catch it!","instructions":"Mouse click or tap to play","url":"https:\\/\\/html5.gamemonetize.com\\/solbljhembpof7yo8r23hu90gu1n5d3v\\/","category":"Sports","tags":"Grimace, HTML, HTML5, Skibidi, Skibidi Toilet","thumb":"https:\\/\\/img.gamemonetize.com\\/solbljhembpof7yo8r23hu90gu1n5d3v\\/512x384.jpg","width":"768","height":"1024"},{"id":"48391","title":"Goal Skibidi Goal","description":"Goal Skibidi Goal is a fast-paced, physics-based soccer game where you control a little character with your head. The goal is to score more goals than your opponent by heading the ball into their net. You can jump, duck, and slide to control the ball, and you can also use power-ups to give yourself an edge.","instructions":"Tap to Player for jump","url":"https:\\/\\/html5.gamemonetize.com\\/hzeisj2a991z0lo3bhi2jf084bwllbk6\\/","category":"Sports","tags":"2D, Arcade, Ball, Football, Fun, Game, Games, NapTech Games, Online, Ski, Skibidi, Skibidi Toilet, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/hzeisj2a991z0lo3bhi2jf084bwllbk6\\/512x384.jpg","width":"1280","height":"720"},{"id":"48300","title":"Skibidi Toilet Tennis","description":"Like in a great tennis game, Help Skibidi Toilet to stopping the tennis balls! but requires speed and precision, make one mistake and you&rsquo;re out! its may be simple to play but it&rsquo;s a challenge to get high scores! The longer You stay on ground, the faster the tennis balls will come at you and it is your job to return them while also avoiding flying bottles. Youre warned! the Platinum medal is VERY hard to complete! only if youre a true grand slam may catch it!","instructions":"Mouse click or tap to play","url":"https:\\/\\/html5.gamemonetize.com\\/90ie5u1rn2x61ly7yktw3dq6u5kbqj2m\\/","category":"Sports","tags":"Arcade, Ball, HTML5, Mobile, Skibidi, Skibidi Toilet, Sport, Sports, Tennis","thumb":"https:\\/\\/img.gamemonetize.com\\/90ie5u1rn2x61ly7yktw3dq6u5kbqj2m\\/512x384.jpg","width":"768","height":"1024"},{"id":"48251","title":"Upin Ipin Sepak Bola","description":"Upin Ipin Sepak Bola Permainan bola sepak yang menyeronokkan. Mampukan anda menewaskan Upin di lapangan sepak bola? Ayoohh kita berseronok sambil bermain game sepak bola upin ipin ini","instructions":"keyboard","url":"https:\\/\\/html5.gamemonetize.com\\/dbc7mw2mns2ii57lkrbexvelvfhz90pz\\/","category":"Sports","tags":"Football, Kids, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/dbc7mw2mns2ii57lkrbexvelvfhz90pz\\/512x384.jpg","width":"800","height":"600"},{"id":"47999","title":"2d basketball runner","description":"the game control is simple and easy is just hold left mouse button on the ball and chose the way that u want the ball move to but isnt too easy inside the game you need to pass all those things with physics","instructions":" hold left mouse button on the ball or just click on the ball from direction that u want push the ball from","url":"https:\\/\\/html5.gamemonetize.com\\/hxgw9ao48gub9cskdmlnfll19u99gsmt\\/","category":"Sports","tags":"1 Player, 2D, Basketball, running, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/hxgw9ao48gub9cskdmlnfll19u99gsmt\\/512x384.jpg","width":"800","height":"600"},{"id":"47973","title":"Womens World Cup 2023","description":"Womens world cup is here and you find yourself in the elimination rounds. Win trophies for your first win, getting to the finals or scoring 20 goals. Of course, the most important one is the world cup trophy. Can you make it to the finals and in it all? Good luck!","instructions":"Mouse click or tap to set direction of your shot again to set height and one more time to set curve of your kick When defending click or tap keeper gloves that appear as your opponent is about to kick","url":"https:\\/\\/html5.gamemonetize.com\\/2xmopvaig70eb5svyq9706xqrkbz4plu\\/","category":"Sports","tags":"Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/2xmopvaig70eb5svyq9706xqrkbz4plu\\/512x384.jpg","width":"960","height":"540"},{"id":"47985","title":"Free Kick Master","description":"A free kick master game where you can feel like a professional football player who has the task of forgetting as many goals as possible. In the game you have to hit the marked goal in the gate and forget as many beautiful goals from different distances as possible. The game has 3 stadiums with different modes such as penalty, free kick, wall and more Come in and try to become a free kick master, have fun!!!","instructions":"How hard you hit the ball and hit the target more money is given with which you can buy different balls in the store You need to control the flight of the ball with the mouse or with your finger if you play on the phone ","url":"https:\\/\\/html5.gamemonetize.com\\/2cbuiwx2ny4y2l1rpaycme9z6kc23fec\\/","category":"Sports","tags":"3D, Android, Ball, Boy, Boys, Football, Funny, Mobile, Soccer, Sport, Sports, Unity3D, WebGL","thumb":"https:\\/\\/img.gamemonetize.com\\/2cbuiwx2ny4y2l1rpaycme9z6kc23fec\\/512x384.jpg","width":"800","height":"600"},{"id":"47635","title":"Messi New Challenge","description":"Messi makes the move to a new Continent and new challenges await. Participate in the excitement and go through numerous goal scoring and skill testing levels and earn trophies too.","instructions":"Mouse or finger to move player during juggling levels swipe to shoot at targets or goal","url":"https:\\/\\/html5.gamemonetize.com\\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\\/","category":"Sports","tags":"Football, Soccer, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\\/512x384.jpg","width":"500","height":"800"},{"id":"47448","title":"Goal Quest","description":"Experience the fusion of sports and puzzle-solving in this captivating 2D soccer ball game. Break through cube stone obstacles by simply touching them, clearing your path to the goal. But it&rsquo;s not just about scoring; you must also collect three stars scattered throughout each level to unlock new challenges. Navigate intricate mazes, utilize physics, and explore visually stunning environments as you strive to become the ultimate soccer ball champion. Are you ready for an adventure filled with excitement, discovery, and a touch of soccer magic?","instructions":"Desktop Explode Cubes with leftmouse button Mobile Touch the screen and pop whatever you want","url":"https:\\/\\/html5.gamemonetize.com\\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\\/","category":"Sports","tags":"1 Player, Brain, Football, Fun, Funny, Puzzle, Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\\/512x384.jpg","width":"1280","height":"720"},{"id":"47154","title":"Crazy BasketBall Machine","description":"Experience the ultimate basketball shooting frenzy in Crazy Basketball Machine! Get ready to test your shooting skills and aim for glory on the court. This action-packed game combines the thrill of basketball with the excitement of precise shooting. Step up to the challenge, shoot hoops, and dominate the game like a true basketball superstar. With stunning visuals and addictive gameplay, Crazy Basketball Machine will keep you hooked as you shoot your way to victory. So grab your basketball and prepare for an adrenaline-fueled shooting extravaganza that will leave you craving for more!","instructions":"Use mouse to play the game or tap the Screen to shoot the Ball ","url":"https:\\/\\/html5.gamemonetize.com\\/coedq4jfww6cxgkq0l39fchkl6uj3nbf\\/","category":"Sports","tags":"Baseball, Basketball, Casual, Hypercasual, Shoot, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/coedq4jfww6cxgkq0l39fchkl6uj3nbf\\/512x384.jpg","width":"800","height":"600"},{"id":"46991","title":"Pixel Ball League","description":"Outshine your friends and assert your dominance by scoring five goals through precise shots. Embrace the exhilarating thrill of victory and savor the gratifying joy of outplaying your opponents at every turn. Get ready for filled with intense competition and memorable moments. Enjoy the journey!!","instructions":"Keyboard You can move the blue character by pressing the W key You can move the red character by pressing the up arrow key Mobile You can move the characters with the blue and red keys on the screen ","url":"https:\\/\\/html5.gamemonetize.com\\/ea9sxvc1urr1rzjwj2ue449rcfgn7560\\/","category":"Sports","tags":"2 Player, Ball, Football, Mobile, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/ea9sxvc1urr1rzjwj2ue449rcfgn7560\\/512x384.jpg","width":"834","height":"548"},{"id":"45937","title":"Hoops &amp; Fruits","description":"Get ready for a slam dunk of fun with Hoops &amp; Fruits, the ultimate basketball puzzle game! Score points by shooting hoops and solving challenging puzzles, all while enjoying a fruity twist. With over 100 levels to play, youll never run out of excitement as you work your way through increasingly difficult challenges. Master the game by perfecting your aim and using power-ups to clear tricky obstacles. Whether youre a basketball fanatic or just looking for a fun and addictive puzzle game, Hoops","instructions":"tap and drag to draw line","url":"https:\\/\\/html5.gamemonetize.com\\/lq9fckxfx08v52umn29ys5zgg2zopw2p\\/","category":"Sports","tags":"2D, Adventure, endless, HTML, HTML5, Online","thumb":"https:\\/\\/img.gamemonetize.com\\/lq9fckxfx08v52umn29ys5zgg2zopw2p\\/512x384.jpg","width":"1080","height":"1920"},{"id":"47118","title":"Tiny Football Cup","description":"Become a football legend by winning all the tournaments and matches! Unlock all the leagues and play with 28 different teams. Prove to your friends you are the number one football player. Play and Score! Endless 3 Turnaments Local Multiplayer Mode 28 Teams","instructions":"Play matches and tournaments to win in-game currency and diamonds Control your team and get the ball to enemys goal Have fun with friends in the local multiplayer mode ","url":"https:\\/\\/html5.gamemonetize.com\\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\\/","category":"Sports","tags":"2 Player, 2 Player Games, Football","thumb":"https:\\/\\/img.gamemonetize.com\\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\\/512x384.jpg","width":"800","height":"600"},{"id":"47289","title":"Pocket Tennis","description":"Pocket Tennis is the best tennis game ever! Enjoy thrilling gameplay, beautiful graphics and pack of action! Pick your racket and choose your ball. Get ready to go onto the court in this brand new tennis game! Pocket Tennis is a great addition to the world of mobile sports games. Experience tennis like never before, in this fresh and easy to play tennis game. In Pocket Tennis you will enjoy a casual gameplay experience, while still remaining loyal to the original game. Clash with your opponents and smash hard!","instructions":"For Desktop use Mouse to swipe For Mobile use touch to swipe ","url":"https:\\/\\/html5.gamemonetize.com\\/z18oyrpxlzo1c47krfwhf4wwx10nqkvw\\/","category":"Sports","tags":"1 Player, 3D Games, Arcade, Best, Casual, Fun, Games, Hypercasual, Sports, Tennis","thumb":"https:\\/\\/img.gamemonetize.com\\/z18oyrpxlzo1c47krfwhf4wwx10nqkvw\\/512x384.jpg","width":"800","height":"600"},{"id":"47156","title":"Heroes Head Ball","description":"Have you ever seen him play football with his head? yes, its a football game where you score goals with your head. are you up for head football? Score a goal in head soccer with your friend and one of you wins. You have to score the most goals to win. You can play with your friend or you can play with artificial intelligence. All you have to do is choose 1 of 10 characters and start the match.","instructions":" Use Arrow Keys ZX Keys to play in single player mode Use WASD NM AND Arrow Keys Num1 Num2 Keys to play in Two Player mode Mobile Touch Control Avaiable ","url":"https:\\/\\/html5.gamemonetize.com\\/6p5xuxtae0zoal3wkwdcndjs4vd35wdn\\/","category":"Sports","tags":"2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Arena, Ball, Battle, Best, Boy, Boys, Highscore, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/6p5xuxtae0zoal3wkwdcndjs4vd35wdn\\/512x384.jpg","width":"800","height":"600"},{"id":"46742","title":"Shoot a Goal!","description":"In this game you need to score a goal. Be accurate and hit the ball into the goal! Good luck!","instructions":"Mouse","url":"https:\\/\\/html5.gamemonetize.com\\/v0u43no4eytqdhym63oaw7q1t64mx56b\\/","category":"Sports","tags":"Boys, Football, HTML5, Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/v0u43no4eytqdhym63oaw7q1t64mx56b\\/512x384.jpg","width":"450","height":"800"},{"id":"46685","title":"Cardboard Racing Time","description":"Play Loud House Extreme Cardboard Racing online for free. Extreme Cardboard Racing is a unique take on the racing genre. In this game, youre not racing against several other competitors. Your racing against a previous competitors old record in the same track. Finish each course as fast as you can while beating the previous record. This game is rendered in mobile-friendly HTML5, so it offers cross-device gameplay. You can play it on mobile devices like Apple iPhones, Google Android powered cell phones from manufactures like Samsung, tablets like the iPad or Kindle Fire, laptops, and Windows-powered desktop computers. All game files are store","instructions":"DRIVE Arrow Lift And Arrow Right for pc DRIVE TURN LIFT AND RIGHT FOR MOBILE AND","url":"https:\\/\\/html5.gamemonetize.com\\/5cst9t5m51wz3ssu0al0xybk81q1me46\\/","category":"Sports","tags":"Car, Cars, crash, Race, Racing, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/5cst9t5m51wz3ssu0al0xybk81q1me46\\/512x384.jpg","width":"800","height":"600"},{"id":"36073","title":"Wrestle Online   Sports Game","description":"Wrestle Online is not only a wrestle but also a relaxation arcade game made from 2D cartoon game art animation. Try to hit your opponents head to the ground in five rounds. You can choose 1 Player, 2 Players, and Multiplayer mode to play. It is allowed you to customize your character with the gold coins. Good luck and have fun Wrestle Online!","instructions":"Tap or click ","url":"https:\\/\\/html5.gamemonetize.com\\/9mprkxjrbb5l3ng8x7browgpaa8w2i5l\\/","category":"Sports","tags":"Boy, Boys, Fun, H5, HTML5, Kid, Kids, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/9mprkxjrbb5l3ng8x7browgpaa8w2i5l\\/512x384.jpg","width":"1280","height":"720"},{"id":"46603","title":"Golf Golf","description":"It&rsquo;s time to have the finest experience of Golf Games. There is lot of fun with challenging physics puzzle of realistic golf games are waiting for you in it. Set aim, complete various interesting tasks of Golf. Throw the ball into the hole and be the champ of Golf Games.","instructions":"Mouse click or tap to play","url":"https:\\/\\/html5.gamemonetize.com\\/jw04a9xs8qe5suixr8flrc6uhkns4nmw\\/","category":"Sports","tags":"Golf, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/jw04a9xs8qe5suixr8flrc6uhkns4nmw\\/512x384.jpg","width":"800","height":"600"},{"id":"45791","title":"Draw Dash","description":"Draw your way to the hoop and slam dunk! Play the best basketball game! Get ready to experience the ultimate basketball challenge with Draw Dash Basketball! This exciting game lets you take control of the ball and dribble your way to the hoop with your finger. Use your creativity and draw your own path to victory, avoiding obstacles and defeating opponents as you make your way to the basket.","instructions":"tap and drag to draw line ","url":"https:\\/\\/html5.gamemonetize.com\\/kj4siixaqg90olkatnbexnugeliqsdc6\\/","category":"Sports","tags":"1 Player, 2D, HTML, HTML5, Online, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/kj4siixaqg90olkatnbexnugeliqsdc6\\/512x384.jpg","width":"1080","height":"1920"},{"id":"43706","title":"Brazil vs Argentina Challenge","description":"Brazil vs Argentina Challenge Online Head The Ball Games is an exciting online game that allows you to experience the thrill of football in a fun and engaging way. The game is all about heading the ball and scoring as many goals as possible to win the match.","instructions":"tap to jump","url":"https:\\/\\/html5.gamemonetize.com\\/nb65nzi26h2c0dts85thpcpmln841jjl\\/","category":"Sports","tags":"Action, Arcade, HTML, HTML5, Interactive, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/nb65nzi26h2c0dts85thpcpmln841jjl\\/512x384.jpg","width":"1280","height":"720"},{"id":"45541","title":"Swipe Basketball Neon","description":"It&rsquo;s time to show off your basketball shooting skills! Feel like a real basketball star behind the free-throwing line. Align your feet, aim the shot, look up to the rim, and toss the ball! See how the basketball flies and swishes the rim like a professional basket player. Your mission is simple: Swipe up your finger on the screen of your smartphone or tablet to control the direction of the ball to score points after points! Just make sure that you dont miss the shot or you will have to start over.","instructions":"Swipe to shoot basketball","url":"https:\\/\\/html5.gamemonetize.com\\/b1sf1a3d8u0l64tat3ddgjgp4gihwtut\\/","category":"Sports","tags":"Basketball, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/b1sf1a3d8u0l64tat3ddgjgp4gihwtut\\/512x384.jpg","width":"720","height":"1280"},{"id":"45548","title":"Minigolf Clash","description":"Its time for minigolf and for you to show off your creativity. Use the different golf balls to your advantage and glide through the levels with ease. Buy more levels with the rewards and hone your golf skills.","instructions":"Get your golf ball in the hole with as smallest number of strokes possible Take advantage of the unique balls for different creative solutions Use the rewards to buy more golf balls and progressively more difficult levels ","url":"https:\\/\\/html5.gamemonetize.com\\/ywl5omork0jwarou5xrxinfjgxphqh6s\\/","category":"Sports","tags":"1 Player, Golf","thumb":"https:\\/\\/img.gamemonetize.com\\/ywl5omork0jwarou5xrxinfjgxphqh6s\\/512x384.jpg","width":"800","height":"600"},{"id":"45153","title":"Tennis Feel","description":"An exciting sports game for agility and reaction speed, in which you will have the opportunity to take part in the largest annual tennis tournament!","instructions":"Mouse","url":"https:\\/\\/html5.gamemonetize.com\\/fmk2d4i1ygm2bixaumwd80q1qrjjgywn\\/","category":"Sports","tags":"2D, Arcade, HTML5, Online, Tennis","thumb":"https:\\/\\/img.gamemonetize.com\\/fmk2d4i1ygm2bixaumwd80q1qrjjgywn\\/512x384.jpg","width":"800","height":"600"},{"id":"41233","title":"Playoff Basketball ","description":"Win the play in game and get into the playoffs then go all the way to the championship, The road to the top is not easy, opponent sharpshooters and pesky defenders stand in the way","instructions":"Use mouse or finger to aim click or lift finger to shoot","url":"https:\\/\\/html5.gamemonetize.com\\/nq2uemy2zrzpnkcwcw9yebqx38assd4d\\/","category":"Sports","tags":"Basketball, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/nq2uemy2zrzpnkcwcw9yebqx38assd4d\\/512x384.jpg","width":"800","height":"600"},{"id":"45384","title":"Neymar can play","description":"Neymar may be injured but he can still play. Brasil or PSG Neymar, your choice, get those crutches ready and get on the pitch to score some awesome goals and earn trophies","instructions":"move with mouse or finger left click or lift finger to kick on goal","url":"https:\\/\\/html5.gamemonetize.com\\/0gpxu3prgjpltlbh8mtlc5gvdzrtfu50\\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/0gpxu3prgjpltlbh8mtlc5gvdzrtfu50\\/512x384.jpg","width":"800","height":"600"},{"id":"43704","title":"Ninja Head Ball","description":"Play as a ninja and score goals with your head in this exciting head Ball game! Ninja Head Ball is a thrilling soccer game that puts your ninja skills to the test! Play as a ninja and compete in matches against other players from around the world. Use your head to score goals and defeat your opponents.","instructions":"tap to jump","url":"https:\\/\\/html5.gamemonetize.com\\/186gqokhhndpvari7bemzg0bwa9gd1fw\\/","category":"Sports","tags":"Adventure, Casual, Football, HTML, HTML5, Hypercasual, jump, Jumping, Online","thumb":"https:\\/\\/img.gamemonetize.com\\/186gqokhhndpvari7bemzg0bwa9gd1fw\\/512x384.jpg","width":"1920","height":"1080"},{"id":"45808","title":"Poppy Basketball","description":"Poppy Basketball a fun sport game to play on. This is the game just to throw as many balls as you can and achieve high score. Aim the ball exactly in the basket and archive goal.","instructions":"Just one Click Tap to play ","url":"https:\\/\\/html5.gamemonetize.com\\/5brbz412mue9yh34yua2ws3gmleu8cbo\\/","category":"Sports","tags":"Arcade, Basketball, Family, HTML, HTML5, Kids, Mobile, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/5brbz412mue9yh34yua2ws3gmleu8cbo\\/512x384.jpg","width":"768","height":"1024"},{"id":"44044","title":"Dunk Shot","description":"Dunk Shot Basketball is a popular basketball game that can be played on mobile devices. The game involves shooting a basketball into a hoop that moves up and down the screen, with the aim of getting as many baskets as possible within a set time limit. Collect stars to buy more balls.","instructions":"Slide to shoot balls","url":"https:\\/\\/html5.gamemonetize.com\\/nfungeu1lgtd3uholrztk9r8gwwgtsxl\\/","category":"Sports","tags":"Arcade, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/nfungeu1lgtd3uholrztk9r8gwwgtsxl\\/512x384.jpg","width":"720","height":"1280"},{"id":"43929","title":"Head Soccer Exclusive","description":"The new season of the soccer goals championship is about to start and it\\&#39;s time for you to hurry up and enter the Head Soccer Exclusive game if you don\\&#39;t want to miss the start. Choose a mode: single or two and two players will enter the field. If you play alone, the game bot will oppose you. In the case of a double game, you will have a real opponent who controls his player. The match will only last one minute. The one who throws more balls into the opponent\\&#39;s goal will become the winner and receive his champion\\&#39;s cup. Therefore, as soon as the whistle sounds, try to quickly get the ball to the goal and throw it before the opponent understands anything in Head Soccer Exclusive.","instructions":"Use Arrows keys or touch buttons on your devices ","url":"https:\\/\\/html5.gamemonetize.com\\/bar5kh2hkbdlwjqvx7pq5eoegu3zc12b\\/","category":"Sports","tags":"Best, Fun, Funny, HTML5, Hypercasual, Kids, Mobile, Skill, Soccer, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/bar5kh2hkbdlwjqvx7pq5eoegu3zc12b\\/512x384.jpg","width":"1280","height":"720"},{"id":"38042","title":"Real Motocross","description":"Get ready for an amazing gaming experience with the most realistic moto cross game on Android! Race with the AI in single player mode or online with your friends in multiplayer mode! Repair your bike and upgrade parts to win on increasingly difficult tracks!","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/awmd9oe0fvtfbuf50vtz6k451t4agzcv\\/","category":"Sports","tags":"Game, Games, Moto, Motorcycle","thumb":"https:\\/\\/img.gamemonetize.com\\/awmd9oe0fvtfbuf50vtz6k451t4agzcv\\/512x384.jpg","width":"800","height":"600"},{"id":"43629","title":"Paper Boats Racing","description":"This is a topdown racing game with paper boats! Try playing 10 different tracks and in different scenarios. To qualify \\u2013 and unlock clues \\u2013 you must come in at least third place. Along the way you will also find speed power ups.","instructions":"On mobile devices tap the directional arrows on the screen On the desktop use the WASD keys or the arrow keys ","url":"https:\\/\\/html5.gamemonetize.com\\/22uqsu22b9wlj1ox9nnwaqg253zncgce\\/","category":"Sports","tags":"1 Player, 2D, Action, Racing","thumb":"https:\\/\\/img.gamemonetize.com\\/22uqsu22b9wlj1ox9nnwaqg253zncgce\\/512x384.jpg","width":"854","height":"480"},{"id":"41804","title":"Wrecked! 2","description":"Wrecked! 2 is a survival strategy game","instructions":"Mouse Touch left right","url":"https:\\/\\/html5.gamemonetize.com\\/9mfzm6x54139093u4qp243wo1de8o9ap\\/","category":"Sports","tags":"Cars, Racing, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/9mfzm6x54139093u4qp243wo1de8o9ap\\/512x384.jpg","width":"800","height":"600"},{"id":"43431","title":"Sprinter","description":"Sprinter is a simple running game from the Flash era. Beat all of your opponents in a 100-meter sprint. Your opponents get faster, so you\\u2019ll have to keep up and ensure you don\\u2019t fall! Sprint Faster Than the Rest Sprint with fury to the finish line in this classic Flash game from Gamedesign.jp. Click the left and right arrow keys rapidly to gain momentum and speed past your opponents to reach the finish line. Be careful to time your key tapping accurately, otherwise you may stumble!","instructions":"You can play this game with the arrow keys Click on the screen if the game doesn t react when you use the arrow keys ","url":"https:\\/\\/html5.gamemonetize.com\\/hh90yoihuo53syyljqu19nalp0zhxued\\/","category":"Sports","tags":"Racing, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/hh90yoihuo53syyljqu19nalp0zhxued\\/512x384.jpg","width":"800","height":"600"},{"id":"44993","title":"El Clasico","description":"El Clasico, the greatest rivalry in all of sport. Here is your chance to get involved, Choose Real or Barca and win the El Clasico","instructions":"Tap or Click to set direction height and curve of your shot","url":"https:\\/\\/html5.gamemonetize.com\\/yha7c2v8calegde0qdunmgn8zlj9xdf7\\/","category":"Sports","tags":"Football, Soccer, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/yha7c2v8calegde0qdunmgn8zlj9xdf7\\/512x384.jpg","width":"960","height":"540"},{"id":"43367","title":"Ski Rush","description":"Ski down the mountain as long as possible avoiding obstacles. Collect flags to increase your score!","instructions":"Touch or mouse","url":"https:\\/\\/html5.gamemonetize.com\\/qhm0nbxkucx74gkbrix22wywohn2lwrz\\/","category":"Sports","tags":"Ski, Sport, Sports, Winter","thumb":"https:\\/\\/img.gamemonetize.com\\/qhm0nbxkucx74gkbrix22wywohn2lwrz\\/512x384.jpg","width":"970","height":"960"},{"id":"25559","title":"Baseball Pro","description":"Baseball Pro is a HTML5 Sport Game. Try to make as many home runs as possible!","instructions":"Touch or mouse","url":"https:\\/\\/html5.gamemonetize.com\\/nr54twuf62qdmbknx5mncl66yh9hbk1k\\/","category":"Sports","tags":"Baseball, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/nr54twuf62qdmbknx5mncl66yh9hbk1k\\/512x384.jpg","width":"790","height":"960"},{"id":"43026","title":"Paper Golf Master 3D","description":"Play with friends. Play with Legends! Play a 1-on-1 golf game in the most exciting multiplayer Golf ever! Play on gorgeous courses against golfers all over the world in real-time online matches! Sink birdies and ace the greens in the world\\u2019s #1 multiplayer golf game now! Paper Golf Master 3D Features: - Compete in real-time stroke play golf games against other players - Smooth, simple controls for easy-to-learn gameplay - Progress through more challenging courses as you raise the stakes - Conquer special tournament rounds, take mega prizes, and be the golf champion - Play with your friends: Golf together with your friends anytime anywhere! - Customize your golfer and pack your bag with all sorts of power ups - Beautiful 3D graphics and realistic 3D physics","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/fy7ttag686rleumkmdx378hj5vp267zw\\/","category":"Sports","tags":"Arcade, Ball, Boys, Girls, Golf, HTML5, Obstacle, Puzzle, Shoot, Shooting, Sport, Sports, Strategy","thumb":"https:\\/\\/img.gamemonetize.com\\/fy7ttag686rleumkmdx378hj5vp267zw\\/512x384.jpg","width":"800","height":"600"},{"id":"44029","title":"Wobbly Boxing","description":"Step into the wobbly and unpredictable world of Wobbly Boxing, where you'll experience the thrill of throwing punches and dodging attacks in a fun and light-hearted environment. If you're looking for a challenge, take on a friend in two-player mode and see who comes out on top. With intuitive controls and dynamic gameplay, Wobbly Boxing is easy to pick up but hard to put down. Featuring colorful and vibrant graphics and a lively soundtrack, Wobbly Boxing is a fresh take on the classic boxing game genre. So get ready to wobble your way to the top and become the ultimate wobbly boxing champion!","instructions":"PLAYER 1 Left Punch F key Right Punch G key Double Punch T key Block Walk backward Dodge Q and E keys PLAYER 2 Left Punch K key Right Punch L key Double Punch O key Block Walk backward Dodge I and P","url":"https:\\/\\/html5.gamemonetize.com\\/nzjzfsjix9ajt19dta4dprv928uizxzb\\/","category":"Sports","tags":"2 Player, 3D, 3D Games, Action, Arcade, Battle, Best, Boxing, Boys, Fighting, Flight, Street Fighting","thumb":"https:\\/\\/img.gamemonetize.com\\/nzjzfsjix9ajt19dta4dprv928uizxzb\\/512x384.jpg","width":"800","height":"600"},{"id":"43791","title":"Speedy Golf","description":"Shoot Incredible Scores! - easy one button three tap play control - caddy does the math for you - play an 18 hole par 72 course in a few minutes - play portrait or landscape - smooth 3D graphics","instructions":"Tap Left and Right Arrows To Aim Tap Swing Three Time To Shoot Caddy Does Not Always Give The Best Advice","url":"https:\\/\\/html5.gamemonetize.com\\/ql8jodciuz3k2u4rjt72faw9ounwb6cz\\/","category":"Sports","tags":"1 Player, 3D, Golf, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/ql8jodciuz3k2u4rjt72faw9ounwb6cz\\/512x384.jpg","width":"800","height":"600"},{"id":"43159","title":"Global Hoops Pro","description":"Master the skill of shooting hoops! Hit nothing but net to earn extra points, collect coins and use them to unlock new balls to play with!","instructions":"Touch click and drag the ball upwards aiming towards the hoop to score ","url":"https:\\/\\/html5.gamemonetize.com\\/yf338qao63dibx9jal40wtye9y5rixk6\\/","category":"Sports","tags":"Basketball, Casual, Skill, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/yf338qao63dibx9jal40wtye9y5rixk6\\/512x384.jpg","width":"480","height":"853"},{"id":"42967","title":"Bucketball","description":"Bucketball is an arcade and shooting casual game. Where you need to shoot the ball into your bucket. Throw ball and try to pass through obstacles to complete the level. Try to pass all 25 levels in game.","instructions":"How to play Drag the left mouse button to aim release to shoot the ball Use touch controls on mobile ","url":"https:\\/\\/html5.gamemonetize.com\\/rtc9zb2da2hg8snax55zmb7t06419cfj\\/","category":"Sports","tags":"Ball, Basketball, Casual, Mobile, Skill","thumb":"https:\\/\\/img.gamemonetize.com\\/rtc9zb2da2hg8snax55zmb7t06419cfj\\/512x384.jpg","width":"960","height":"600"},{"id":"40058","title":"Match Football Brazil or Argentina ","description":"Watch the Brazil versus Argentina match online by finding a reputable website that offers a live stream of the game. By doing this, you'll be able to avoid any potential streaming issues and ensure that you don't miss a minute of the action.","instructions":"Tap To Play","url":"https:\\/\\/html5.gamemonetize.com\\/utno1qhgw42pufphiambxfs0wj9tshdf\\/","category":"Sports","tags":"Arcade, Football, Fun, Funny, Game, Games, Highscore, HTML5, Online, Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/utno1qhgw42pufphiambxfs0wj9tshdf\\/512x384.jpg","width":"720","height":"1280"},{"id":"44120","title":"Ronaldo Soccer Challenge","description":"Ronaldo Soccer Challenge is super fun online game for kids that you can play for free. Ronaldo Soccer Challenge where you need to tap on the screen to guide Ronaldo. Collect balls and avoid the obstacles. Run to the goal! Collect boost to gain speed! Have fun playing.","instructions":"Mouse to play ","url":"https:\\/\\/html5.gamemonetize.com\\/qv5p6orddfqp0ya82s6f6jpmg2ww0pq2\\/","category":"Sports","tags":"Arcade, Avoid, Ball, Casual, Collecting, Football, HTML5, Hypercasual, Obstacle, Skill","thumb":"https:\\/\\/img.gamemonetize.com\\/qv5p6orddfqp0ya82s6f6jpmg2ww0pq2\\/512x384.jpg","width":"854","height":"480"},{"id":"40594","title":"FIFA Score","description":"FIFA Score is an online football penalty game that is perfect for fans of the sport looking to improve their skills. The game features real-life football players, so you can test your abilities against some of the best in the business. With a variety of modes to choose from, including single-player and multiplayer, there is something for everyone. So get out there and start shooting some goals!","instructions":"Tap To Play","url":"https:\\/\\/html5.gamemonetize.com\\/qjtd7ud3ysktv7ii5xcklblw7vjsujy4\\/","category":"Sports","tags":"Arcade, Game, Games, HTML5, Online, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/qjtd7ud3ysktv7ii5xcklblw7vjsujy4\\/512x384.jpg","width":"720","height":"1280"},{"id":"42499","title":"Sonic Speedway","description":"subway rush racing Kart game is a dash classical Poppy racing plateforme. This cute wuggy game racing is very funny and addictive, climb the hill with your sweet poppy on his cut candy truck and avoid obstacles, help wuggy to reach home, go ride of obstacles and get your new high score. You have to reach your destination and overcoming these obstacles and collect more subway coins. You will enjoy the poppy racing game by jumping from the ramp road buggies. We have prepared big wheel truck with a realistic hedgehog game. Great graphics with realistic you prepared truck driving game offers a game full of endeless rush challenging tasks. Enjoy exciting and fun surfer game of 2019. enjoy the adrenaline rush at speed of ultra racing. dash 4 your life at insane speeds on 2 subway train tracks. tap screen to run, dash 2, & rush 2 complete over 100 challenging levels. collect coins to unlock new levels. best game 4 kids and children. download free on google play today. great free game. I hope the blue hedgehog can keep running away from the enemies and hurry, run & jump as fast as you will dodge the moving trains on the subway and escape the chase of the earth criminals. Subway blue hero dash super dash is incredible run. subway rush racing Kart Dash is a free Buggy Kart Racing 3D games, racer blue hero game racing adventure official 2022 is here to provide you with the best gaming experience, rush through your surfer and soni go kart adventure is just aiming to be the ultimate game as it offer you a surprise-filled and ultimately action-packed world of off-road kart racing. Be aware & keep your eyes on the wheel. Dash lady bug and in its own adventures with our crash racing games! Subway blue hero game is a 3d fast force super speed endless runner game. Just choose your character. subway blue Poppy hero dash, This is an excellent boom crazy 3D running game, surfer dash rush subway run as fast as you can! subway blue hero dash super dash is an incredible run. How to play subway super blue hero surf dash game: - Run as far as you from security guard to achieve playing this game. - Collect coins & Power-Ups to win within the subway rush hedgehogs game - Swipe to turn, jump and slide to avoid hitting the obstacles and - Swipe down to roll over - Press the screen twice to hit the enemy by poppy hero the hedgehogs or knuckles hero and begin boom dashing through the subways adventure! run, rush, dash & jump as fast as you'll to dodge the oncoming trains in the subway and escape the inspectors, join now the foremost thrilling dash race, just run like crazy and challenge your limit. we are sure you gonna be addicted to this rush endless racing game dach after you try it. just go and download it and score better than your friends! Swipe to turn, jump and slide to avoid hitting obstacles, barrier and Subway 3D,collect coins and buy power up. Unlock new characters, and see how far you can run with sonic speedy Underground city adventure travel along the subway tracks start now,surf with your friends. Run like hell and challenge your limit. But Rush must be a very fun run surfe game. Download it now and start your Subway and Rush run at the forest surf,","instructions":"This cute wuggy game racing is very funny and addictive climb the hill with your sweet poppy on his cut candy truck and avoid obstacles help wuggy to reach home go ride of obstacles and get your new high score","url":"https:\\/\\/html5.gamemonetize.com\\/7kgksjkletyjuepkcobenjy28gh7e9hl\\/","category":"Sports","tags":"Car, Cartoon, Racing, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/7kgksjkletyjuepkcobenjy28gh7e9hl\\/512x384.jpg","width":"800","height":"600"},{"id":"27455","title":"Cool Moto Racer","description":"Enjoy 3D bike racing game and be an xtreme bike rider. Perform insane stunt actions on Extreme Stunt Bike. Compete with elite riders in motorbike simulator. In this Impossible Moto Bike Track Stunts, you must have a real motorbike stunt driving skills. We believe that you will enjoy ramp bike game a lot of addictive fun by playing this real moto bike stunt game that is most attractive impossible bike track stunt in the sky road environment.","instructions":"Arrows","url":"https:\\/\\/html5.gamemonetize.com\\/m4er4lakmqb8zhp64c5upr4cqn67nemu\\/","category":"Sports","tags":"2D, 3D, 3D Games, Action, Adult, Adventure, Aircraft, Arcade, Arena, Arkanoid, Army, Avoid, Baby, Baby Hazel, Batman, Battle, Battlegrounds, Bejeweled, Ben 10, Bike, Boy, Boys, Brain, Brawl, Candy, Car, Card, Cars, Cartoon, Cartoon Network, Casino, Clash, Classic, Cleaning, Click, Clicker, Collecting, Craft, Crafting, Crazy, CSGO, Decorate, Decoration, Dora, Dragon, Dragon Ball Z, Fighting, Friv, Game, Games, Gun, Killing, Play, Race, Racing, Samurai, Shoot, Strategy, Traffic, Train, Zombie","thumb":"https:\\/\\/img.gamemonetize.com\\/m4er4lakmqb8zhp64c5upr4cqn67nemu\\/512x384.jpg","width":"800","height":"600"},{"id":"43826","title":"Las Vegas Poker","description":"Play one of the most exciting card games in the world. Win up to 3 types of big tournaments and unlock your avatar. Rule the poker game and become King Of The Table. Collect daily rewards, custom your game mode and live the excitement of Las Vegas Casino.","instructions":"A round of poker is won by having the highest winning combination of 5 cards consisting of the 2 cards in a player s hand and the 5 cards on the table A player proceeds to the next round of bets only if their bet is equal to the other players Standard","url":"https:\\/\\/html5.gamemonetize.com\\/9tipe1jv9rmgplp51gs8lw7nalqqb59k\\/","category":"Sports","tags":"Poker","thumb":"https:\\/\\/img.gamemonetize.com\\/9tipe1jv9rmgplp51gs8lw7nalqqb59k\\/512x384.jpg","width":"800","height":"600"},{"id":"41857","title":"Free Kick World Cup 2022","description":"<b>Free Kick World Cup 2022<\\/b>, one of the best soccer games 2022. Play digital soccer: Free Kick World Cup 2022 now. Experience realistic free kick offline.<br> <br>One of the best soccer games in 2022 from the developers of Football Craft. If you got tired of uncontrollable free-kick offline games <b>Free Kick World Cup 2022<\\/b> is the game that you are looking for. Digital Soccer: free kick 2022 offers you realistic soccer simulation physics and a soccer ball kick system. Prepare your soccer player and get ready for the battle with the world's best soccer teams from 20 major leagues on best of soccer games 2022. Love soccer? Try our real soccer kicks.<br> <br>Practice with free kick offline, random shoots, and hit target modes. Challenge with the tournament, real-time multiplayer, and survival modes. Try the best soccer games in 2022. Enjoy the best 3d soccer free kick 2022 game with stunning graphics.<br> Download one of the best soccer games of 2022 today.<br> <br> <b>FEATURES<\\/b> <br> - Full control over the soccer ball<br> - Real-time Multiplayer games with friends<br> - A real challenge for the world's best goal<br> - Online replay system<br> - 6 Different game modes like free kick offline.<br> - 183 Unique soccer world cup tournament stages<br> - Ability to customize and develop your soccer player<br> - Online leaderboards and 20+ achievements<br> - Super slow motion effects<br> - Top of soccer games 2022<br> - Real soccer kicks and real soccer ball movement.<br>","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/qd68lm6gy8j770jit57qhaw0uq17hhju\\/","category":"Sports","tags":"1 Player, Ball, Casual, Clicker, Football, HTML5, Kids, Point And Click, Shoot, Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/qd68lm6gy8j770jit57qhaw0uq17hhju\\/512x384.jpg","width":"800","height":"600"},{"id":"40593","title":"Football Score","description":"Football Score Online is an exciting game where you can compete with other players to see who can score the most points. The game is a shooter game, so you'll need to be quick on your feet and have a good aim.","instructions":"Tap To Play","url":"https:\\/\\/html5.gamemonetize.com\\/qk8pg1s97laofnwug5cv1fcgl7tmfqfv\\/","category":"Sports","tags":"Arcade, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/qk8pg1s97laofnwug5cv1fcgl7tmfqfv\\/512x384.jpg","width":"720","height":"1280"},{"id":"40251","title":"Brazil vs Argentina","description":"The Brazil vs Argentina game will be played online for free. Play Brazil take on Argentina in an exciting game that you can view for free online! Two of South America's most iconic soccer teams are set to battle it out in an online video game. Brazil and Argentina have a long-standing rivalry, and fans of both teams will be excited to see them face off in this digital arena. The game is free to play, so anyone can join in on the fun.","instructions":"Tap To Play","url":"https:\\/\\/html5.gamemonetize.com\\/mebhny1b9qraqw519juf3n0r3qx0mg15\\/","category":"Sports","tags":"Arcade, Ball, Football, Highscore, Soccer, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/mebhny1b9qraqw519juf3n0r3qx0mg15\\/512x384.jpg","width":"720","height":"1280"},{"id":"39679","title":"Ketchapp Basketball","description":"Become a basketball star in Ketchapp Basketball! Score as many points as you can by shooting the ball in the basket, you will directly get +2 points if you make a direct shot !","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/v162dv9vwwh3zfu5tisqcfozi781dcve\\/","category":"Sports","tags":"Basketball, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/v162dv9vwwh3zfu5tisqcfozi781dcve\\/512x384.jpg","width":"800","height":"600"},{"id":"42759","title":"Angry Cats","description":"Angry Cats is an exciting sports game to play for all ages. Play this technical game which tests your aiming ability to make a goal. How long you can stay in the game is determined by how well you can aim. Calculate the right angle and degree of force and shoot the Cats through into the basket!","instructions":"just one Click Tap to paly ","url":"https:\\/\\/html5.gamemonetize.com\\/f2addyig754h6ezcv6pkht0e0ysj4brb\\/","category":"Sports","tags":"Animal, Basketball, Boy, Cat, HTML, HTML5, Mobile, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/f2addyig754h6ezcv6pkht0e0ysj4brb\\/512x384.jpg","width":"1024","height":"600"},{"id":"42771","title":"Running Back DX","description":"Infinite running back game. See how far you can get and how many touchdowns you can score. Pick up power as you run and other powerups. You can run through and knock down defenders with less power than you","instructions":"Mouse or finger to move","url":"https:\\/\\/html5.gamemonetize.com\\/6zw7og5mh36pzzm3277du1e6x067lijx\\/","category":"Sports","tags":"Football, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/6zw7og5mh36pzzm3277du1e6x067lijx\\/512x384.jpg","width":"450","height":"800"},{"id":"41175","title":"Cricket Legends","description":"\"Cricket Legends\" allows you not only to get to know such a sports game as cricket, but also to play it, making an attempt to become a real legend and write your name in history. The player will succeed if he manages to show maximum concentration in the process of completing game tasks.","instructions":"Click on the screen ","url":"https:\\/\\/html5.gamemonetize.com\\/0btdcgcm830ab5rmoxr64a9oozxfjvbh\\/","category":"Sports","tags":"Ball, Ballon, Baseball, Click, Clicker, Shoot, Shooting, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/0btdcgcm830ab5rmoxr64a9oozxfjvbh\\/512x384.jpg","width":"800","height":"600"},{"id":"41115","title":"Jewel Classic Block Puzzle Tetrix","description":"This is Block Puzzle Tetrix Jewel Classic an addictive and easy-to-learn game where you bend your mind and fly your fingers. Place blocks to create and destroy entire rows vertically and horizontally on the screen. The more rows you delete at once, the more points you will earn. There is no time limit and you can enjoy the game anytime, anywhere. There is no splash screen! !! !! Only the game and your brain. A challenging puzzle world for your mind! Use strategy and tactical science. fun!","instructions":"Mouse or tap to play","url":"https:\\/\\/html5.gamemonetize.com\\/xjpjk6mhosvdcryf2kddtbagrqg5tjt9\\/","category":"Sports","tags":"2 Player, 3D, 3D Games, Arcade, Baby, Balance, Ballon, Brain, bus, Candy, Car, Card, Cars, Clans, Craft, Crazy, Drawing, Easter, HTML5, Kid, Kids, Kill, Lego, Logical, Mine, Platform, Poker, Retro, Skills, Slacking, Spongebob, Sword, Tennis, Train, Witch, Wolf, World, Worm, Worms, Zombie","thumb":"https:\\/\\/img.gamemonetize.com\\/xjpjk6mhosvdcryf2kddtbagrqg5tjt9\\/512x384.jpg","width":"800","height":"600"},{"id":"41301","title":"Super Simple Soccer","description":"Super Simple Soccer as its name suggests is a fresh and easy to play soccer game. In this game, all you have to do is score more goals than the other team before the 90-second timer runs out. You need to win five matches in a row to lift the world cup. Features: \\u2022 Fresh and simple gameplay \\u2022 Pick your own team's name and color \\u2022 Tackle, sprite, jump, and shoot \\u2022 Sound effects","instructions":"- Arrow keys to move up down left and right - Press Z key to Jump - Press X key to Tackle Sprint - Press C key to Shoot ","url":"https:\\/\\/html5.gamemonetize.com\\/7vydxmim8r289apeby6tftyo9sy8hz7v\\/","category":"Sports","tags":"1 Player, Ball, Casual, Football, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/7vydxmim8r289apeby6tftyo9sy8hz7v\\/512x384.jpg","width":"854","height":"480"},{"id":"40598","title":"FIFA Soccer 2023","description":"Prepare yourself for your authentic FIFA World Cup 2022 journey with EA SPORTSFIFA Mobile. Build your Ultimate Team and kick off your soccer journey in FIFA World Cup 2022 today. Immerse yourself in the world\\u2018s greatest soccer tournament. FIFA Mobile is the only officially licensed FIFA World Cup 2022mobile game where you can play through the official tournament brackets with any of the 32 qualified nations. The new \\u201823 season is here! The new season includes updated players, kits, clubs, leagues and national teams to reflect the real world 22\\/23 soccer season! Build your dream team in FIFA Mobile - collect players and put your favorite soccer stars to the test. With over 15,000 authentic soccer stars to choose from including world-class talent like Kylian Mbapp\\u00e9, Vini Jr, and Christian Pulisic, plus 600+ teams including Real Madrid and Manchester City. Score goals with some of the world\\u2019s best players as you level up a team of soccer superstars. Compete against the best in pvp modes, including Head-to-Head, VS Attack and the all new Manager Mode, where you choose strategic tactics for your team so they can rise in rank to FIFA Champions. Champions are made in FIFA Mobile. World-class competition, realistic sports game thrills, real time 11v11 gameplay, and authentic soccer game action await. Kick it in the next generation of mobile soccer games.","instructions":"Use Your Mouse","url":"https:\\/\\/html5.gamemonetize.com\\/j6y0wq913tf5t6iswkgr5t70i4d0ouwz\\/","category":"Sports","tags":"8 Ball Pool, Football, Soccer, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/j6y0wq913tf5t6iswkgr5t70i4d0ouwz\\/512x384.jpg","width":"800","height":"600"},{"id":"41396","title":"Soccer Pixel","description":"Are you ready to play a football match which is in style of retro and simple to play against your friend as well as entertaining? You should score five goals to win the game.","instructions":"You can control the game in mobil devices by touching screen and you can control the in PC with W and UP ARROW KEY Besides the players run fast by accelerating depending on how much you press on control keys ","url":"https:\\/\\/html5.gamemonetize.com\\/5eiokpkimaww38e65fdq104qqxie766f\\/","category":"Sports","tags":"2 Player, 2 Player Games, 2D, Football, Pixel, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/5eiokpkimaww38e65fdq104qqxie766f\\/512x384.jpg","width":"800","height":"600"},{"id":"40903","title":"Boxing Random","description":"The most fun and random challenges begin with Boxing Random. Each round starts another fun with its own options. Sometimes long arms, sometimes icy field or rocket punches greet you. Send punches to the enemy's head. You can score this way. The first to reach a score of 5 wins the game!","instructions":"Player 1 W Player 2 UP ARROW KEY You can play the game by touch controls on mobile devices or tablets ","url":"https:\\/\\/html5.gamemonetize.com\\/p4pa453tundv6gm5t1af3633vq0nay9r\\/","category":"Sports","tags":"2 Player, 2 Player Games, Boxing, Fight, Fighting, Pixel, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/p4pa453tundv6gm5t1af3633vq0nay9r\\/512x384.jpg","width":"800","height":"600"},{"id":"39581","title":"Ski Rush 3D","description":"Ski Rush 3D is an interesting and very entertaining lite game.Drag right and left to move your legs out of the way and choose the right path to reach the destination. Be careful of the obstacles on your way.","instructions":"Slide left right to move ","url":"https:\\/\\/html5.gamemonetize.com\\/pgsd73bb8blo05gi7tnfcgwelfthzvh8\\/","category":"Sports","tags":"3D, Arcade, running, Skating, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/pgsd73bb8blo05gi7tnfcgwelfthzvh8\\/512x384.jpg","width":"480","height":"800"},{"id":"40818","title":"Santa Basket","description":"Santa Basket is an exciting sports game to play for all ages. Play this technical game which tests your aiming ability to make a goal. How long you can stay in the game is determined by how well you can aim. Calculate the right angle and degree of force and shoot Santa through into the basket!","instructions":"Just one click tap to play ","url":"https:\\/\\/html5.gamemonetize.com\\/i6pp3hbeulpivdbzc8gnf6in6kjurrpd\\/","category":"Sports","tags":"Basketball, Boys, Casual, HTML, HTML5, Kids, Mobile, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/i6pp3hbeulpivdbzc8gnf6in6kjurrpd\\/512x384.jpg","width":"1280","height":"800"},{"id":"24393","title":"LamborghiniParking3","description":"Park your luxury car to the designated position, which requires superb control. Do you dare to challenge? Today, we came back to want park our luxury car. At the beginning of the game. Single person, double person and three person respectively. Park your luxury car in the designated parking space smoothly. Don't touch anything else. This game supports the phones. There is no multiplayer mode on the mobile terminal. You can play on the computer in multiplayer mode.enjoy your fully.","instructions":"P1 can press W s a and d to operate the vehicle movement and blank to brake P2 can press the left right up and down keys to operate the vehicle movement and the keypad 1 brakes P3 press I K J and L to op","url":"https:\\/\\/html5.gamemonetize.com\\/bltnauh5b7uptbr1ezj2yncpeiac03jn\\/","category":"Sports","tags":"2 Player, 2 Player Games, Car, Driving, Parking","thumb":"https:\\/\\/img.gamemonetize.com\\/bltnauh5b7uptbr1ezj2yncpeiac03jn\\/512x384.jpg","width":"960","height":"600"},{"id":"39320","title":"Head Sports Soccer","description":"Do your best to earn scores against your opponents and win the matches! This is a head sports game which is a simplified version of football game. Before each game, you can choose your character and then customize its appearance and other features of the game like playground, weather, AI difficulty, match duration and etc. The rest is simple! You have four buttons to control your character and earn scores against your opponent. Two keys are for moving, one is for jumping and the other one is for kicking the ball with your foot or head","instructions":"Screen controller","url":"https:\\/\\/html5.gamemonetize.com\\/mxg4u39zgocq4san446v7gwqow7m3fiu\\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/mxg4u39zgocq4san446v7gwqow7m3fiu\\/512x384.jpg","width":"800","height":"600"},{"id":"39275","title":"Head Sport Basketball","description":"Do your best to earn scores against your opponents and win the matches! This is a head sports game which is a simplified version of basketball game. Before each game, you can choose your character and then customize its appearance and other features of the game like playground, weather, AI difficulty, match duration and etc. The rest is simple! You have four buttons to control your character and earn scores against your opponent. Two keys are for moving, one is for jumping and the other one is for kicking the ball with your foot or head.","instructions":"Screen control","url":"https:\\/\\/html5.gamemonetize.com\\/e0urtq2lpo8128fr0akdtbdfos2pyldk\\/","category":"Sports","tags":"Basketball, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/e0urtq2lpo8128fr0akdtbdfos2pyldk\\/512x384.jpg","width":"800","height":"600"},{"id":"38489","title":"HOOPS the game","description":"HOOPS is a game in which you have to throw the ball from one basket to the other, without it falling. Throwing the ball directly \\u2013 without it crashing into the hoops \\u2013 will give you extra points. You can also collect coins to customize your ball.","instructions":"Tap the ball and drag down to aim then release to launch ","url":"https:\\/\\/html5.gamemonetize.com\\/sof7vz5nszek3wni0xqh19e7v8zp70ok\\/","category":"Sports","tags":"Basketball, Point And Click, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/sof7vz5nszek3wni0xqh19e7v8zp70ok\\/512x384.jpg","width":"720","height":"1280"},{"id":"39170","title":"GOLF ROYALE","description":"Welcome to the Red Ball game. This game is about the adventure of a red ball based on mini golf. Hundreds of exciting, easy and difficult levels are waiting for you. Can you pass everything? Simple, but at the same time complex gameplay will drag you out for a long time. Compete with your friends, go further and further. Unlock new and new levels. In the game Red Ball every level. All you have to do is kick the ball into the hole. That's all ! But there is one rule: in order to pass the level, you will only have 5 values. Only 5 ratings! In addition, you are waiting for other obstacles on the way to success. These are moving platforms, blocks, chasms, sharp saws and explosive TNT. How do you like that? But first of all, Red Ball is a very addicting and fun game that combines minimalism and addictive gameplay, steeped in hardcore level passing, like in the good old Bounce or Gravity Defied. Hurry up to pass the level after the increase!","instructions":"Use the mouse or touchscreen to control To throw the ball you need to pull the indicator like in the game Angry Birds like a slingshot You have 5 attempts to hit the ball into the hole You can restart the level if you didn t succeed to do this use ","url":"https:\\/\\/html5.gamemonetize.com\\/0qd0uezk971vfwx5pwn88vzfw5dq3ur8\\/","category":"Sports","tags":"3D, Best, Golf, Multiplayer","thumb":"https:\\/\\/img.gamemonetize.com\\/0qd0uezk971vfwx5pwn88vzfw5dq3ur8\\/512x384.jpg","width":"1080","height":"1920"},{"id":"38674","title":"Football Strike: Online Soccer","description":"Compete against your friends in head-to-head free kicks, or make a name for yourself in Career Mode! Customize your striker and goalie with tons of unlockable items! Show off your style or wear your team colors!","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/fzzyicgbwh2bg2z9a2gqgsun0wh00req\\/","category":"Sports","tags":"2 Player, 2 Player Games, Football, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/fzzyicgbwh2bg2z9a2gqgsun0wh00req\\/512x384.jpg","width":"800","height":"600"},{"id":"40273","title":"Sketch Dunk","description":"Hold the basketball in the air and hit the ring! Beat the record and win. Be careful not to miss the ring! Collect coins and buy skins!","instructions":"To play click on the screen with the mouse if you are playing on a computer If you are playing on your phone then tap the screen with your finger ","url":"https:\\/\\/html5.gamemonetize.com\\/teuwm9nhga1ka7jhu6h9p0b7lqpia885\\/","category":"Sports","tags":"1 Player, 2D, Ball, Basketball, Click, Clicker, Mobile","thumb":"https:\\/\\/img.gamemonetize.com\\/teuwm9nhga1ka7jhu6h9p0b7lqpia885\\/512x384.jpg","width":"1080","height":"1920"},{"id":"39323","title":"Head Volleyball","description":"Do your best to earn scores against your opponents and win the matches! This is a head sports game which is a simplified version of volleyball game. Before each game, you can choose your character and then customize its appearance and other features of the game like playground, weather, AI difficulty, match duration and etc. The rest is simple! You have four buttons to control your character and earn scores against your opponent. Two keys are for moving, one is for jumping and the other one is for kicking the ball with your foot or head","instructions":"Screen controller","url":"https:\\/\\/html5.gamemonetize.com\\/v20jqjml7lem7z382k7rd4m1ge7wvv20\\/","category":"Sports","tags":"Ball, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/v20jqjml7lem7z382k7rd4m1ge7wvv20\\/512x384.jpg","width":"800","height":"600"},{"id":"40207","title":"WorldCup 2022 FK","description":"You are out of the group stage and have to win 4 more games to lift that world cup trophy and make your country proud","instructions":"Tap or Left mouse click to set direction curve and defend","url":"https:\\/\\/html5.gamemonetize.com\\/juh3ozer4ug8ad8xls172qm18mjvabt4\\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/juh3ozer4ug8ad8xls172qm18mjvabt4\\/512x384.jpg","width":"960","height":"540"},{"id":"39516","title":"Head Soccer 2023","description":"Head Soccer 2023 is a sports game. Choose your player and play fast-paced soccer games against your friend or computer. You're in charge of the offense as well as the defense here. Jump, kick. You can also enroll in tournaments if you're looking for a challenge. Go ahead and practice until you can prove you have what it takes to win the tournament! Play and have fun!","instructions":"Use your keyboard arrow Keys to move and X Z Button to kick","url":"https:\\/\\/html5.gamemonetize.com\\/526wa8wnqncmdtr30dum7v95nej98xbr\\/","category":"Sports","tags":"Arcade, Football, Multiplayer, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/526wa8wnqncmdtr30dum7v95nej98xbr\\/512x384.jpg","width":"854","height":"480"},{"id":"38559","title":"Soccer Star 22: World Football","description":"Soccer Star 2022 World Football: World Football has become the best soccer game in the world and this is possible because we offer the possibility to play together with great players in their soccer teams. Don't forget that World Football is the most important soccer tournament in the world and if you manage to win it, you will be a world legend in soccer history.","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/zwntx01hocikqbtsrr3pqpcrx6u444jb\\/","category":"Sports","tags":"2 Player Games, Football, Game, Games, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/zwntx01hocikqbtsrr3pqpcrx6u444jb\\/512x384.jpg","width":"800","height":"600"},{"id":"39777","title":"Football Brawl","description":"Live your football story! Enter the field, decimate your opponent with various powerful kicks and fun and quirky powerups. Finally let them know who is the boss with the emotes system - become a football legend today!","instructions":"Move sideways and jump with the arrow buttons Perform various kicks with the ball buttons Score more goals in the given time and win the match Climb divisions and unlock all rewards Random match powerups and player emotes are available ","url":"https:\\/\\/html5.gamemonetize.com\\/rifgnadbc38y3dj4dypflqh1714zpx1x\\/","category":"Sports","tags":"Ball, Football, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/rifgnadbc38y3dj4dypflqh1714zpx1x\\/512x384.jpg","width":"800","height":"600"},{"id":"38465","title":"GX Racing","description":"GX Racing is a new motorcycle racing game enjoyed by hundreds of thousands of players around the world. Unlock 20 amazing motorcycles, choose your character and enjoy an infinite number of customizations! Compete against your opponents in over 100 races from New York to Tokyo.","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/r9iwm9veqk3oxrmunl4c8p3vzyfs18y6\\/","category":"Sports","tags":"Race, Racing, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/r9iwm9veqk3oxrmunl4c8p3vzyfs18y6\\/512x384.jpg","width":"800","height":"600"},{"id":"27072","title":"Moto X3M Halloween","description":"Moto X3M is a bike racing game with crazy stunts and a twist on deadly obstacles and explosive crashes. With the different levels in challenges, the extremely dangerous but no less attractive high speed, the game will blow you away with its exciting features. Welcome to the special \"Spooky Land\" version of this awesome bike stunt game. Have fun with Moto X3M 6 Spooky Land!","instructions":"User arrow keys to control","url":"https:\\/\\/html5.gamemonetize.com\\/hlmgvewlf6122xcmkubad7s5f0ajf1fo\\/","category":"Sports","tags":"Bike, Halloween, Moto, Motorcycle","thumb":"https:\\/\\/img.gamemonetize.com\\/hlmgvewlf6122xcmkubad7s5f0ajf1fo\\/512x384.jpg","width":"720","height":"480"},{"id":"38009","title":"Funny Tennis","description":"It is a tennis game that you can only play against bots. You can win the tournament and play with new characters.","instructions":"Tab to screen","url":"https:\\/\\/html5.gamemonetize.com\\/8xr8a6iqqrrov06tk5mvckqtnfmyj9jf\\/","category":"Sports","tags":"Sport, Tennis","thumb":"https:\\/\\/img.gamemonetize.com\\/8xr8a6iqqrrov06tk5mvckqtnfmyj9jf\\/512x384.jpg","width":"800","height":"600"},{"id":"37805","title":"Funny Finger Soccer","description":"Beat your opponent","instructions":"Hit the ball by clicking the screen","url":"https:\\/\\/html5.gamemonetize.com\\/mrrwe0ji48jhhhol8glws4xvpt99htsc\\/","category":"Sports","tags":"Football, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/mrrwe0ji48jhhhol8glws4xvpt99htsc\\/512x384.jpg","width":"800","height":"600"},{"id":"38546","title":"Basketball Online","description":"Get your favorite ball and make lots of great dunk shots in different beautiful locations!","instructions":"GAME FEATURES - outstanding visuals - realistic physics model - wide variety of balls and locations ","url":"https:\\/\\/html5.gamemonetize.com\\/peshwa0e4jg3k6fxkd1xhi1jdyl9etpz\\/","category":"Sports","tags":"Basketball, Game, Games, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/peshwa0e4jg3k6fxkd1xhi1jdyl9etpz\\/512x384.jpg","width":"800","height":"600"},{"id":"37975","title":"Funny Sea Fishing","description":"It\\u2019s a nice sunny day and our little friend, the Happy Penguin, decided to go on a fishing trip for cute sea animals and fishes to put in his little aquarium \\u2013 come and experience the joy! But, remember, you are not fishing for sharks \\u2013 they are very strong and will break your fishing rod! Have the best time catching fishes in this fishing game for free!","instructions":"Tab to screen","url":"https:\\/\\/html5.gamemonetize.com\\/l8cjfk6jj6mwd9ccal4gn1zgoe6w7gbz\\/","category":"Sports","tags":"Fish, Fishing","thumb":"https:\\/\\/img.gamemonetize.com\\/l8cjfk6jj6mwd9ccal4gn1zgoe6w7gbz\\/512x384.jpg","width":"960","height":"600"},{"id":"39023","title":"Pumpkin Basket","description":"Halloween season is coming so play this great pumpkin basket game!!! Pumpkin Basketball is an exciting basket sport game to play for all ages! Play this technical game which tests your aiming ability to make a goal! How long you can stay in the game is determined by how well you can aim. So calculate the right angle and degree of force and shoot the Pumpkin through into the basket! - Endless Gameplay. - Cute Graphic. - Halloween Theme.","instructions":"Tap or Click to play ","url":"https:\\/\\/html5.gamemonetize.com\\/452329z2z5elkq91iqxsgrtnraf30fwv\\/","category":"Sports","tags":"Basketball, Casual, endless, Game, Games, HTML, HTML5, Mobile, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/452329z2z5elkq91iqxsgrtnraf30fwv\\/512x384.jpg","width":"1280","height":"800"},{"id":"38929","title":"Kick Off","description":"A dynamic sport game based on physics. Bounce the ball and try to make it into the goal. You loose a chance when the ball drops below the edge of the screen.","instructions":"Drag to move the player character Moving the player character into the ball will make the ball bounce Do not let the ball fall below the edge of the screen You score when the ball bounces into the goal on the top of the screen ","url":"https:\\/\\/html5.gamemonetize.com\\/xa6u972vuf7i1xoe352yzjm7lxvhpkve\\/","category":"Sports","tags":"Football, Play, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/xa6u972vuf7i1xoe352yzjm7lxvhpkve\\/512x384.jpg","width":"600","height":"800"},{"id":"39031","title":"Soccer Kid vs Huggy","description":"Various levels of fun soccer action against your favorite monster. Kick the ball at him to knock him out, score goals, outsmart him and come out on top","instructions":"Swipe to kick","url":"https:\\/\\/html5.gamemonetize.com\\/k78had981iftg6zb10tmma57d6cfkpwk\\/","category":"Sports","tags":"Action, Skill, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/k78had981iftg6zb10tmma57d6cfkpwk\\/512x384.jpg","width":"450","height":"800"},{"id":"38624","title":"Skate Race","description":"Fun game in which you must go as far as possible, collecting coins and dodging birds, add points and unlock new skins.","instructions":"Use the A key left click or touch the screen on your mobile phone to jump ","url":"https:\\/\\/html5.gamemonetize.com\\/63xjzi0rl2pgofcgppzqaqo8qileryeh\\/","category":"Sports","tags":"1 Player, Casual, Race, Skating, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/63xjzi0rl2pgofcgppzqaqo8qileryeh\\/512x384.jpg","width":"640","height":"360"},{"id":"38435","title":"Pong Cricket","description":"Pong Cricket is an online arcade game that tests your skills and reflexes. Pong Cricket is an online game that provides players with a fun and challenging experience. The game is perfect for players who enjoy arcade-style gaming and who are looking for a new and exciting way to spend their free time.","instructions":"Tap To Play","url":"https:\\/\\/html5.gamemonetize.com\\/96rd6tub5c6ev026uf0x6nlmrhkvwppe\\/","category":"Sports","tags":"Arcade, Ball, Game, Games, HTML5, Hypercasual, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/96rd6tub5c6ev026uf0x6nlmrhkvwppe\\/512x384.jpg","width":"720","height":"1280"},{"id":"37534","title":"PJ Masks - Sticky Splat Soccer","description":"Sticky Splat Soccer is the game with which today we are starting off our category of PJ Masks Games, a brand new category of Disney Junior Games for which we have planned multiple new and awesome games for you all to enjoy, one more awesome than the other one, and we highly recommend that you stick with us today, since we have not one, but five such games coming for you, one more worth your time than the other. You will be playing soccer with these heroes, and we teach you how right here and now, so make sure you pay close attention! Begin by choosing who of the three heroes you want to be. You will be the goalkeeper, having to catch all of the balls thrown at you, getting points in return for each of them you grab. There will be a point that will start extending on the lines on the right and left, and you have to click on them when they get the biggest they can so that you get the timing right and catch the ball. It is as simple as that, so don't stand around, but start playing and having fun with this game right away!","instructions":"Use the mouse ","url":"https:\\/\\/html5.gamemonetize.com\\/5xpnahvxzsbym3k5dpt84ia98h31y776\\/","category":"Sports","tags":"Adventure, Anime, Arcade, Cartoon, Cartoon Network, Disney, Football, HTML5, Kids, Shoot, Shooting, Soccer","thumb":"https:\\/\\/img.gamemonetize.com\\/5xpnahvxzsbym3k5dpt84ia98h31y776\\/512x384.jpg","width":"800","height":"600"},{"id":"37537","title":"Skateboard Challenge Game ","description":"\\u201cSkateboard Challenge\\u201d is a very fun extreme Sport Game! Your objective is to collect all the letters that form the word \\u201cS-K-A-T-E\\u201d and also the letters that form the word \\u201cC-O-M-B-O\\u201d, as well as reaching a target score contained in all levels. Beat all the levels performing different extreme maneuvers, use the rail to make combinations of maneuvers and multiply your score! Collect coins to unlock characters. A super radical .","instructions":"game to play with your friends Have a good time ","url":"https:\\/\\/html5.gamemonetize.com\\/xj7mfa3oydungoyhr3o44ngxews0mlwv\\/","category":"Sports","tags":"Skateboard","thumb":"https:\\/\\/img.gamemonetize.com\\/xj7mfa3oydungoyhr3o44ngxews0mlwv\\/512x384.jpg","width":"800","height":"600"},{"id":"37854","title":"Crazy Basketball","description":"Crazy Basketball Machine simulates the realistic physics and features great graphics, nice game room environment and your very own virtual hand to shoot some hoops.","instructions":"Click the ball","url":"https:\\/\\/html5.gamemonetize.com\\/ax6oce4egmzqok1obl3ewrwyuzg7oldy\\/","category":"Sports","tags":"Arcade, Basketball, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/ax6oce4egmzqok1obl3ewrwyuzg7oldy\\/512x384.jpg","width":"800","height":"600"},{"id":"32452","title":"Trials Frontier","description":"Play the mobile version of the best game in the critically acclaimed Trials series from award-winning publisher RedLynx! Experience the ultimate motorcycle game for smartphones and tablets for free!","instructions":"","url":"https:\\/\\/html5.gamemonetize.com\\/76zrt3sjnq3g82c3kd2h6yp8tnt7qx64\\/","category":"Sports","tags":"Game, Games, Moto, Motorcycle","thumb":"https:\\/\\/img.gamemonetize.com\\/76zrt3sjnq3g82c3kd2h6yp8tnt7qx64\\/512x384.jpg","width":"800","height":"600"},{"id":"36059","title":"Basketball Line - Draw The Dunk Line","description":"Draw a line and make the falling ball score the basket! Time your drawings properly and avoid the bombs! Start drawing and dunk the balls!","instructions":"Tap or click ","url":"https:\\/\\/html5.gamemonetize.com\\/q3kmzjunadtxkw3c55y3465ru3m9vknq\\/","category":"Sports","tags":"Basketball, Boy, Boys, Draw, Fun, H5, HTML5, Kid, Kids, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/q3kmzjunadtxkw3c55y3465ru3m9vknq\\/512x384.jpg","width":"480","height":"853"},{"id":"36715","title":"Bicycle Racing Game BMX Rider","description":"","instructions":"use keyboard","url":"https:\\/\\/html5.gamemonetize.com\\/zatal27c3r9m8lcw6gs9hx6o8z3mjwej\\/","category":"Sports","tags":".io, 2D, 3D, Adventure, Android, Arcade, Bike, Race, Racing","thumb":"https:\\/\\/img.gamemonetize.com\\/zatal27c3r9m8lcw6gs9hx6o8z3mjwej\\/512x384.jpg","width":"900","height":"600"},{"id":"38342","title":"Coconut Basketball","description":"Coconut Basketball is an exciting sports game to play for all ages. Play this technical game which tests your aiming ability to make a goal. How long you can stay in the game is determined by how well you can aim. Calculate the right angle and degree of force and shoot the coconut through into the basket!","instructions":"One Click Tap to play ","url":"https:\\/\\/html5.gamemonetize.com\\/x3qzjklc0t0yy3qm6n709nabl74xf6ua\\/","category":"Sports","tags":"Arcade, Ball, Basketball, Boy, Boys, HTML, HTML5, Mobile, Sport, Sports","thumb":"https:\\/\\/img.gamemonetize.com\\/x3qzjklc0t0yy3qm6n709nabl74xf6ua\\/512x384.jpg","width":"768","height":"1024"},{"id":"30974","title":"Celebrity Party","description":"The academy awards, sequins and celebrities. Then, here comes the dinner to end this special day. But unfortunetly, the celebrities are unpredictable and nothing goes as planned. A fight breaks out! Between Justin Bibeer, Lady Gogo or Oprah Windfray nothing works! Select your favorite celebrity and fight against the others.","instructions":"Choose your star and climb into the ring Alone against all 2 against 2 or 4 against 4 you must push other out of the place Your character turns around and advances only when you press the button Play solo or multiplayer with your friends Show them ","url":"https:\\/\\/html5.gamemonetize.com\\/k9yxmr0qmdox2hsfbseophflckto67ps\\/","category":"Sports","tags":"Casual, Celebrity, Fight, Mario, Movie, Multiplayer, Sport","thumb":"https:\\/\\/img.gamemonetize.com\\/k9yxmr0qmdox2hsfbseophflckto67ps\\/512x384.jpg","width":"600","height":"800"}]}